{
  "generated": "2026-01-26T02:28:56.136Z",
  "source": "California Legislature (leginfo.legislature.ca.gov)",
  "description": "Actual text content from California state codes for commonly-asked legal questions",
  "codes": {
    "CIV": {
      "name": "Civil Code",
      "sections": [
        {
          "code": "CIV",
          "section": "1940",
          "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=CIV&sectionNum=1940",
          "text": "(a) Except as provided in subdivision (b), this chapter shall apply to all persons who hire dwelling units located within this state including tenants, lessees, boarders, lodgers, and others, however denominated.\n\n(b) The term “persons who hire” shall not include a person who maintains either of the following:\n\n(1) Transient occupancy in a hotel, motel, residence club, or other facility when the transient occupancy is or would be subject to tax under Section 7280 of the Revenue and Taxation Code. The term “persons who hire” shall not include a person to whom this paragraph pertains if the person has not made valid payment for all room and other related charges owing as of the last day on which his or her occupancy is or would be subject to tax under Section 7280 of the Revenue and Taxation Code.\n\n(2) Occupancy at a hotel or motel where the innkeeper retains a right of access to and control of the dwelling unit and the hotel or motel provides or offers all of the following services to all of the residents:\n\n(A) Facilities for the safeguarding of personal property pursuant to Section 1860.\n\n(B) Central telephone service subject to tariffs covering the same filed with the California Public Utilities Commission.\n\n(C) Maid, mail, and room services.\n\n(D) Occupancy for periods of less than seven days.\n\n(E) Food service provided by a food establishment, as defined in Section 113780 of the Health and Safety Code, located on or adjacent to the premises of the hotel or motel and owned or operated by the innkeeper or owned or operated by a person or entity pursuant to a lease or similar relationship with the innkeeper or person or entity affiliated with the innkeeper.\n\n(c) “Dwelling unit” means a structure or the part of a structure that is used as a home, residence, or sleeping place by one person who maintains a household or by two or more persons who maintain a common household.\n\n(d) Nothing in this section shall be construed to limit the application of any provision of this chapter to tenancy in a dwelling unit unless the provision is so limited by its specific terms.",
          "scraped": "2026-01-26T02:28:56.348Z",
          "title": "Application of tenant law",
          "keywords": ["tenant", "rental", "lease"]
        },
        {
          "code": "CIV",
          "section": "1940.2",
          "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=CIV&sectionNum=1940.2",
          "text": "(a) It is unlawful for a landlord to do any of the following for the purpose of influencing a tenant to vacate a dwelling:\n\n(1) Engage in conduct that violates subdivision (a) of Section 484 of the Penal Code.\n\n(2) Engage in conduct that violates Section 518 of the Penal Code.\n\n(3) Use, or threaten to use, force, willful threats, or menacing conduct constituting a course of conduct that interferes with the tenant’s quiet enjoyment of the premises in violation of Section 1927 that would create an apprehension of harm in a reasonable person. Nothing in this paragraph requires a tenant to be actually or constructively evicted in order to obtain relief.\n\n(4) Commit a significant and intentional violation of Section 1954.\n\n(5) Threaten to disclose information regarding or relating to the immigration or citizenship status of a tenant, occupant, or other person known to the landlord to be associated with a tenant or occupant. This paragraph does not require a tenant to be actually or constructively evicted in order to obtain relief.\n\n(b) A tenant who prevails in a civil action, including an action in small claims court, to enforce his or her rights under this section is entitled to a civil penalty in an amount not to exceed two thousand dollars ($2,000) for each violation.\n\n(c) An oral or written warning notice, given in good faith, regarding conduct by a tenant, occupant, or guest that violates, may violate, or violated the applicable rental agreement, rules, regulations, lease, or laws, is not a violation of this section. An oral or written explanation of the rental agreement, rules, regulations, lease, or laws given in the normal course of business is not a violation of this section.\n\n(d) This section does not enlarge or diminish a landlord’s right to terminate a tenancy pursuant to existing state or local law; nor does this section enlarge or diminish any ability of local government to regulate or enforce a prohibition against a landlord’s harassment of a tenant.",
          "scraped": "2026-01-26T02:28:56.964Z",
          "title": "Landlord entry requirements",
          "keywords": ["landlord entry", "notice", "privacy"]
        },
        {
          "code": "CIV",
          "section": "1941",
          "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=CIV&sectionNum=1941",
          "text": "Section Nineteen Hundred and Forty-one. The lessor of a building intended for the occupation of human beings must, in the absence of an agreement to the contrary, put it into a condition fit for such occupation, and repair all subsequent dilapidations thereof, which render it untenantable, except such as are mentioned in section nineteen hundred and twenty-nine.",
          "scraped": "2026-01-26T02:28:57.581Z",
          "title": "Habitability requirements",
          "keywords": ["habitability", "repairs", "livable"]
        },
        {
          "code": "CIV",
          "section": "1941.1",
          "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=CIV&sectionNum=1941.1",
          "text": "(a) A dwelling shall be deemed untenantable for purposes of Section 1941 if it substantially lacks any of the following affirmative standard characteristics or is a residential unit described in Section 17920.3 or 17920.10 of the Health and Safety Code:\n\n(1) Effective waterproofing and weather protection of roof and exterior walls, including unbroken windows and doors.\n\n(2) Plumbing or gas facilities that conformed to applicable law in effect at the time of installation, maintained in good working order.\n\n(3) A water supply approved under applicable law that is under the control of the tenant, capable of producing hot and cold running water, or a system that is under the control of the landlord, that produces hot and cold running water, furnished to appropriate fixtures, and connected to a sewage disposal system approved under applicable law.\n\n(4) Heating facilities that conformed with applicable law at the time of installation, maintained in good working order.\n\n(5) Electrical lighting, with wiring and electrical equipment that conformed with applicable law at the time of installation, maintained in good working order.\n\n(6) Building, grounds, and appurtenances at the time of the commencement of the lease or rental agreement, and all areas under control of the landlord, kept in every part clean, sanitary, and free from all accumulations of debris, filth, rubbish, garbage, rodents, and vermin.\n\n(7) An adequate number of appropriate receptacles for garbage and rubbish, in clean condition and good repair at the time of the commencement of the lease or rental agreement, with the landlord providing appropriate serviceable receptacles thereafter and being responsible for the clean condition and good repair of the receptacles under their control.\n\n(8) Floors, stairways, and railings maintained in good repair.\n\n(9) A locking mail receptacle for each residential unit in a residential hotel, as required by Section 17958.3 of the Health and Safety Code. This subdivision shall become operative on July 1, 2008.\n\n(10) Except as provided in subdivision (b), a stove that is maintained in good working order and capable of safely generating heat for cooking purposes. A stove that is subject to a recall by the manufacturer or a public entity is not capable of safely generating heat for cooking purposes. This paragraph shall only apply to a lease entered into, amended, or extended on or after January 1, 2026.\n\n(11) (A) Except as provided in subdivision (b) and subparagraph (B), a refrigerator that is maintained in good working order and capable of safely storing food. A refrigerator that is subject to recall by the manufacturer or a public entity is not capable of safely storing food.\n\n(B) A tenant and landlord may mutually agree when the lease is signed if the tenant chooses to provide and maintain their own refrigerator, provided that all of the following apply:\n\n(i) The lease contains a statement in substantially the following form:\n\n“Under state law, the landlord is required to provide a refrigerator in good working order in your unit. By checking this box, you acknowledge that you have asked to bring your own refrigerator and that you are responsible for keeping that refrigerator in working order.”\n\n(ii) The lease provides that the tenant may, with 30 days written notice, inform the landlord that they no longer wish to keep their own refrigerator in the unit, and that at the end of the 30-day notice period, the landlord shall install a refrigerator in good working order in the unit.\n\n(iii) A landlord shall not condition a tenancy upon the tenant providing their own refrigerator.\n\n(iv) The landlord shall not be responsible for the maintenance of a refrigerator provided by the tenant.\n\n(C) This paragraph shall only apply to a lease entered into, amended, or extended on or after January 1, 2026.\n\n(b) The characteristics described in paragraphs (10) and (11) of subdivision (a) shall not apply to any of the following:\n\n(1) Permanent supportive housing, as that term is defined in paragraph (2) of subdivision (c) of Section 8698.4 of the Government Code.\n\n(2) A single-room occupancy unit that provides living and sleeping space for the exclusive use of the occupant, including those in which occupants share food preparation facilities with occupants.\n\n(3) A unit in a residential hotel, as that term is defined in paragraph (1) of subdivision (b) of Section 50519 of the Health and Safety Code.\n\n(4) A dwelling unit within a housing facility that offers shared or communal kitchen spaces to its residents, including a dwelling unit within an assisted living facility.\n\n(c) (1) A landlord shall repair or replace a stove or refrigerator that is subject to recall by the manufacturer or a public entity, as described in paragraphs (10) and (11) of subdivision (a), within 30 days of receiving notice that the stove or refrigerator is subject to recall.\n\n(2) Nothing in this subdivision shall be construed to prohibit a tenant from exercising any ",
          "scraped": "2026-01-26T02:28:58.196Z",
          "title": "Untenantable dwelling conditions",
          "keywords": ["uninhabitable", "conditions", "repairs"]
        },
        {
          "code": "CIV",
          "section": "1942",
          "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=CIV&sectionNum=1942",
          "text": "(a) If within a reasonable time after written or oral notice to the landlord or his agent, as defined in subdivision (a) of Section 1962, of dilapidations rendering the premises untenantable which the landlord ought to repair, the landlord neglects to do so, the tenant may repair the same himself where the cost of such repairs does not require an expenditure more than one month’s rent of the premises and deduct the expenses of such repairs from the rent when due, or the tenant may vacate the premises, in which case the tenant shall be discharged from further payment of rent, or performance of other conditions as of the date of vacating the premises. This remedy shall not be available to the tenant more than twice in any 12-month period.\n\n(b) For the purposes of this section, if a tenant acts to repair and deduct after the 30th day following notice, he is presumed to have acted after a reasonable time. The presumption established by this subdivision is a rebuttable presumption affecting the burden of producing evidence and shall not be construed to prevent a tenant from repairing and deducting after a shorter notice if all the circumstances require shorter notice.\n\n(c) The tenant’s remedy under subdivision (a) shall not be available if the condition was caused by the violation of Section 1929 or 1941.2.\n\n(d) The remedy provided by this section is in addition to any other remedy provided by this chapter, the rental agreement, or other applicable statutory or common law.",
          "scraped": "2026-01-26T02:28:58.818Z",
          "title": "Tenant remedy for breach",
          "keywords": ["repair", "deduct", "remedy"]
        },
        {
          "code": "CIV",
          "section": "1942.4",
          "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=CIV&sectionNum=1942.4",
          "text": "(a) A landlord of a dwelling may not demand rent, collect rent, issue a notice of a rent increase, or issue a three-day notice to pay rent or quit pursuant to subdivision (2) of Section 1161 of the Code of Civil Procedure, if all of the following conditions exist prior to the landlord’s demand or notice:\n\n(1) The dwelling substantially lacks any of the affirmative standard characteristics listed in Section 1941.1 or violates Section 17920.10 of the Health and Safety Code, or is deemed and declared substandard as set forth in Section 17920.3 of the Health and Safety Code because conditions listed in that section exist to an extent that endangers the life, limb, health, property, safety, or welfare of the public or the occupants of the dwelling.\n\n(2) A public officer or employee who is responsible for the enforcement of any housing law, after inspecting the premises, has notified the landlord or the landlord’s agent in writing of his or her obligations to abate the nuisance or repair the substandard conditions.\n\n(3) The conditions have existed and have not been abated 35 days beyond the date of service of the notice specified in paragraph (2) and the delay is without good cause. For purposes of this subdivision, service shall be complete at the time of deposit in the United States mail.\n\n(4) The conditions were not caused by an act or omission of the tenant or lessee in violation of Section 1929 or 1941.2.\n\n(b) (1) A landlord who violates this section is liable to the tenant or lessee for the actual damages sustained by the tenant or lessee and special damages of not less than one hundred dollars ($100) and not more than five thousand dollars ($5,000).\n\n(2) The prevailing party shall be entitled to recovery of reasonable attorney’s fees and costs of the suit in an amount fixed by the court.\n\n(c) Any court that awards damages under this section may also order the landlord to abate any nuisance at the rental dwelling and to repair any substandard conditions of the rental dwelling, as defined in Section 1941.1, which significantly or materially affect the health or safety of the occupants of the rental dwelling and are uncorrected. If the court orders repairs or corrections, or both, the court’s jurisdiction continues over the matter for the purpose of ensuring compliance.\n\n(d) The tenant or lessee shall be under no obligation to undertake any other remedy prior to exercising his or her rights under this section.\n\n(e) Any action under this section may be maintained in small claims court if the claim does not exceed the jurisdictional limit of that court.\n\n(f) The remedy provided by this section may be utilized in addition to any other remedy provided by this chapter, the rental agreement, lease, or other applicable statutory or common law. Nothing in this section shall require any landlord to comply with this section if he or she pursues his or her rights pursuant to Chapter 12.75 (commencing with Section 7060) of Division 7 of Title 1 of the Government Code.",
          "scraped": "2026-01-26T02:28:59.430Z",
          "title": "Rent withholding for violations",
          "keywords": ["rent withhold", "habitability"]
        },
        {
          "code": "CIV",
          "section": "1942.5",
          "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=CIV&sectionNum=1942.5",
          "text": "(a) If the lessor retaliates against the lessee because of the exercise by the lessee of the lessee’s rights under this chapter or because of the lessee’s complaint to an appropriate agency as to tenantability of a dwelling, and if the lessee of a dwelling is not in default as to the payment of rent, the lessor may not recover possession of a dwelling in any action or proceeding, cause the lessee to quit involuntarily, increase the rent, or decrease any services within 180 days of any of the following:\n\n(1) After the date upon which the lessee, in good faith, has given notice pursuant to Section 1942, has provided notice of a suspected bed bug infestation, or has made an oral complaint to the lessor regarding tenantability.\n\n(2) After the date upon which the lessee, in good faith, has filed a written complaint, or an oral complaint which is registered or otherwise recorded in writing, with an appropriate agency, of which the lessor has notice, for the purpose of obtaining correction of a condition relating to tenantability.\n\n(3) After the date of an inspection or issuance of a citation, resulting from a complaint described in paragraph (2) of which the lessor did not have notice.\n\n(4) After the filing of appropriate documents commencing a judicial or arbitration proceeding involving the issue of tenantability.\n\n(5) After entry of judgment or the signing of an arbitration award, if any, when in the judicial proceeding or arbitration the issue of tenantability is determined adversely to the lessor.\n\nIn each instance, the 180-day period shall run from the latest applicable date referred to in paragraphs (1) to (5), inclusive.\n\n(b) A lessee may not invoke subdivision (a) more than once in any 12-month period.\n\n(c) To report, or to threaten to report, the lessee or individuals known to the landlord to be associated with the lessee to immigration authorities is a form of retaliatory conduct prohibited under subdivision (a). This subdivision shall in no way limit the definition of retaliatory conduct prohibited under this section.\n\n(d) Notwithstanding subdivision (a), it is unlawful for a lessor to increase rent, decrease services, cause a lessee to quit involuntarily, bring an action to recover possession, or threaten to do any of those acts, for the purpose of retaliating against the lessee because the lessee has lawfully organized or participated in a lessees’ association or an organization advocating lessees’ rights or has lawfully and peaceably exercised any rights under the law. In an action brought by or against the lessee pursuant to this subdivision, the lessee shall bear the burden of producing evidence that the lessor’s conduct was, in fact, retaliatory.\n\n(e) To report, or to threaten to report, the lessee or individuals known to the landlord to be associated with the lessee to immigration authorities is a form of retaliatory conduct prohibited under subdivision (d). This subdivision shall in no way limit the definition of retaliatory conduct prohibited under this section.\n\n(f) This section does not limit in any way the exercise by the lessor of the lessor’s rights under any lease or agreement or any law pertaining to the hiring of property or the lessor’s right to do any of the acts described in subdivision (a) or (d) for any lawful cause. Any waiver by a lessee of the lessee’s rights under this section is void as contrary to public policy.\n\n(g) Notwithstanding subdivisions (a) to (f), inclusive, a lessor may recover possession of a dwelling and do any of the other acts described in subdivision (a) within the period or periods prescribed therein, or within subdivision (d), if the notice of termination, rent increase, or other act, and any pleading or statement of issues in an arbitration, if any, states the ground upon which the lessor, in good faith, seeks to recover possession, increase rent, or do any of the other acts described in subdivision (a) or (d). If the statement is controverted, the lessor shall establish its truth at the trial or other hearing.\n\n(h) Any lessor or agent of a lessor who violates this section shall be liable to the lessee in a civil action for all of the following:\n\n(1) The actual damages sustained by the lessee.\n\n(2) Punitive damages in an amount of not less than one hundred dollars ($100) nor more than two thousand dollars ($2,000) for each retaliatory act where the lessor or agent has been guilty of fraud, oppression, or malice with respect to that act.\n\n(i) In any action brought for damages for retaliatory eviction, the court shall award reasonable attorney’s fees to the prevailing party if either party requests attorney’s fees upon the initiation of the action.\n\n(j) The remedies provided by this section shall be in addition to any other remedies provided by statutory or decisional law.\n\n(k) A lessor does not violate subdivision (c) or (e) by complying with any legal obligation under any federal government program that provides for rent limitations or rental assistance t",
          "scraped": "2026-01-26T02:29:00.042Z",
          "title": "Retaliation prohibited",
          "keywords": ["retaliation", "eviction", "complaint"]
        },
        {
          "code": "CIV",
          "section": "1946",
          "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=CIV&sectionNum=1946",
          "text": "(a) A hiring of real property, for a term not specified by the parties, is deemed to be renewed as stated in Section 1945, at the end of the term implied by law unless one of the parties gives written notice to the other of that party’s intention to terminate the same, at least as long before the expiration thereof as the term of the hiring itself, not exceeding 30 days; provided, however, that as to tenancies from month to month either of the parties may terminate the same by giving at least 30 days’ written notice thereof at any time and the rent shall be due and payable to and including the date of termination. It shall be competent for the parties to provide by an agreement at the time the tenancy is created that a notice of the intention to terminate the same may be given at any time not less than seven days before the expiration of the term thereof. The notice herein required shall be given in the manner prescribed in Section 1162 of the Code of Civil Procedure or by sending a copy by certified or registered mail addressed to the other party. In addition, the lessee may give the notice by sending a copy by certified or registered mail addressed to the agent of the lessor to whom the lessee has paid the rent for the month prior to the date of the notice or by delivering a copy to the agent personally. The notice given by the lessor shall also contain, in substantially the same form, the following:\n\n“State law permits former tenants to reclaim abandoned personal property left at the former address of the tenant, subject to certain conditions. You may or may not be able to reclaim property without incurring additional costs, depending on the cost of storing the property and the length of time before it is reclaimed. In general, these costs will be lower the sooner you contact your former landlord after being notified that property belonging to you was left behind after you moved out.”\n\n(b) A landlord or its agent shall not charge a tenant a fee for serving, posting, or otherwise delivering any notice, as described in this section.",
          "scraped": "2026-01-26T02:29:00.658Z",
          "title": "Notice to terminate tenancy",
          "keywords": ["notice", "terminate", "end lease"]
        },
        {
          "code": "CIV",
          "section": "1946.2",
          "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=CIV&sectionNum=1946.2",
          "text": "(a) Notwithstanding any other law, after a tenant has continuously and lawfully occupied a residential real property for 12 months, the owner of the residential real property shall not terminate a tenancy without just cause, which shall be stated in the written notice to terminate tenancy. If any additional adult tenants are added to the lease before an existing tenant has continuously and lawfully occupied the residential real property for 24 months, then this subdivision shall only apply if either of the following are satisfied:\n\n(1) All of the tenants have continuously and lawfully occupied the residential real property for 12 months or more.\n\n(2) One or more tenants have continuously and lawfully occupied the residential real property for 24 months or more.\n\n(b) For purposes of this section, “just cause” means either of the following:\n\n(1) At-fault just cause, which means any of the following:\n\n(A) Default in the payment of rent.\n\n(B) A breach of a material term of the lease, as described in paragraph (3) of Section 1161 of the Code of Civil Procedure, including, but not limited to, violation of a provision of the lease after being issued a written notice to correct the violation.\n\n(C) Maintaining, committing, or permitting the maintenance or commission of a nuisance as described in paragraph (4) of Section 1161 of the Code of Civil Procedure.\n\n(D) Committing waste as described in paragraph (4) of Section 1161 of the Code of Civil Procedure.\n\n(E) The tenant had a written lease that terminated on or after January 1, 2020, or January 1, 2022, if the lease is for a tenancy in a mobilehome, and after a written request or demand from the owner, the tenant has refused to execute a written extension or renewal of the lease for an additional term of similar duration with similar provisions, provided that those terms do not violate this section or any other provision of law.\n\n(F) Criminal activity by the tenant on the residential real property, including any common areas, or any criminal activity or criminal threat, as defined in subdivision (a) of Section 422 of the Penal Code, on or off the residential real property, that is directed at any owner or agent of the owner of the residential real property.\n\n(G) Assigning or subletting the premises in violation of the tenant’s lease, as described in paragraph (4) of Section 1161 of the Code of Civil Procedure.\n\n(H) The tenant’s refusal to allow the owner to enter the residential real property as authorized by Sections 1101.5 and 1954 of this code, and Sections 13113.7 and 17926.1 of the Health and Safety Code.\n\n(I) Using the premises for an unlawful purpose as described in paragraph (4) of Section 1161 of the Code of Civil Procedure.\n\n(J) The employee, agent, or licensee’s failure to vacate after their termination as an employee, agent, or a licensee as described in paragraph (1) of Section 1161 of the Code of Civil Procedure.\n\n(K) When the tenant fails to deliver possession of the residential real property after providing the owner written notice as provided in Section 1946 of the tenant’s intention to terminate the hiring of the real property, or makes a written offer to surrender that is accepted in writing by the owner, but fails to deliver possession at the time specified in that written notice as described in paragraph (5) of Section 1161 of the Code of Civil Procedure.\n\n(2) No-fault just cause, which means any of the following:\n\n(A) (i) Intent to occupy the residential real property by the owner or the owner’s spouse, domestic partner, children, grandchildren, parents, or grandparents for a minimum of 12 continuous months as that person’s primary residence.\n\n(ii) For leases entered into on or after July 1, 2020, or July 1, 2022, if the lease is for a tenancy in a mobilehome, clause (i) shall apply only if the tenant agrees, in writing, to the termination, or if a provision of the lease allows the owner to terminate the lease if the owner, or the owner’s spouse, domestic partner, children, grandchildren, parents, or grandparents, unilaterally decides to occupy the residential real property. Addition of a provision allowing the owner to terminate the lease as described in this clause to a new or renewed rental agreement or fixed-term lease constitutes a similar provision for the purposes of subparagraph (E) of paragraph (1).\n\n(iii) This subparagraph does not apply if the intended occupant occupies a rental unit on the property or if a vacancy of a similar unit already exists at the property.\n\n(iv) The written notice terminating a tenancy for a just cause pursuant to this subparagraph shall contain the name or names and relationship to the owner of the intended occupant. The written notice shall additionally include notification that the tenant may request proof that the intended occupant is an owner or related to the owner as defined in subclause (II) of clause (viii). The proof shall be provided upon request and may include an operating agreement and other non",
          "scraped": "2026-01-26T02:29:01.283Z",
          "title": "Just cause eviction",
          "keywords": ["just cause", "eviction", "AB 1482"]
        },
        {
          "code": "CIV",
          "section": "1947.12",
          "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=CIV&sectionNum=1947.12",
          "text": "(a) (1) Subject to subdivision (b), an owner of residential real property shall not, over the course of any 12-month period, increase the gross rental rate for a dwelling or a unit more than 5 percent plus the percentage change in the cost of living, or 10 percent, whichever is lower, of the lowest gross rental rate charged for that dwelling or unit at any time during the 12 months prior to the effective date of the increase. In determining the lowest gross rental amount pursuant to this section, any rent discounts, incentives, concessions, or credits offered by the owner of such unit of residential real property and accepted by the tenant shall be excluded. The gross per-month rental rate and any owner-offered discounts, incentives, concessions, or credits shall be separately listed and identified in the lease or rental agreement or any amendments to an existing lease or rental agreement.\n\n(2) If the same tenant remains in occupancy of a unit of residential real property over any 12-month period, the gross rental rate for the unit of residential real property shall not be increased in more than two increments over that 12-month period, subject to the other restrictions of this subdivision governing gross rental rate increase.\n\n(b) For a new tenancy in which no tenant from the prior tenancy remains in lawful possession of the residential real property, the owner may establish the initial rental rate not subject to subdivision (a). Subdivision (a) is only applicable to subsequent increases after that initial rental rate has been established.\n\n(c) A tenant of residential real property subject to this section shall not enter into a sublease that results in a total rent for the premises that exceeds the allowable rental rate authorized by subdivision (a). Nothing in this subdivision authorizes a tenant to sublet or assign the tenant’s interest where otherwise prohibited.\n\n(d) This section shall not apply to the following residential real properties:\n\n(1) Housing restricted by deed, regulatory restriction contained in an agreement with a government agency, or other recorded document as affordable housing for persons and families of very low, low, or moderate income, as defined in Section 50093 of the Health and Safety Code, or subject to an agreement that provides housing subsidies for affordable housing for persons and families of very low, low, or moderate income, as defined in Section 50093 of the Health and Safety Code or comparable federal statutes.\n\n(2) Dormitories owned and operated by an institution of higher education or a kindergarten and grades 1 to 12, inclusive, school.\n\n(3) Housing subject to rent or price control through a public entity’s valid exercise of its police power consistent with Chapter 2.7 (commencing with Section 1954.50) that restricts annual increases in the rental rate to an amount less than that provided in subdivision (a).\n\n(4) Housing that has been issued a certificate of occupancy within the previous 15 years, unless the housing is a mobilehome.\n\n(5) Residential real property that is alienable separate from the title to any other dwelling unit, including a mobilehome, provided that both of the following apply:\n\n(A) The owner is not any of the following:\n\n(i) A real estate investment trust, as defined in Section 856 of the Internal Revenue Code.\n\n(ii) A corporation.\n\n(iii) A limited liability company in which at least one member is a corporation.\n\n(iv) Management of a mobilehome park, as defined in Section 798.2.\n\n(B) (i) The tenants have been provided written notice that the residential real property is exempt from this section using the following statement:\n\n“This property is not subject to the rent limits imposed by Section 1947.12 of the Civil Code and is not subject to the just cause requirements of Section 1946.2 of the Civil Code. This property meets the requirements of Sections 1947.12 (d)(5) and 1946.2 (e)(8) of the Civil Code and the owner is not any of the following: (1) a real estate investment trust, as defined by Section 856 of the Internal Revenue Code; (2) a corporation; or (3) a limited liability company in which at least one member is a corporation.”\n\n(ii) For a tenancy existing before July 1, 2020, or July 1, 2022, if the lease is for a tenancy in a mobilehome, the notice required under clause (i) may, but is not required to, be provided in the rental agreement.\n\n(iii) For a tenancy commenced or renewed on or after July 1, 2020, or July 1, 2022, if the lease is for a tenancy in a mobilehome, the notice required under clause (i) must be provided in the rental agreement.\n\n(iv) Addition of a provision containing the notice required under clause (i) to any new or renewed rental agreement or fixed-term lease constitutes a similar provision for the purposes of subparagraph (E) of paragraph (1) of subdivision (b) of Section 1946.2.\n\n(6) A property containing two separate dwelling units within a single structure in which the owner occupied one of the units as the owner",
          "scraped": "2026-01-26T02:29:01.904Z",
          "title": "Rent cap (AB 1482)",
          "keywords": ["rent cap", "rent increase", "AB 1482"]
        },
        {
          "code": "CIV",
          "section": "1950.5",
          "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=CIV&sectionNum=1950.5",
          "text": "(a) This section applies to security for a rental agreement for residential property that is used as the dwelling of the tenant.\n\n(b) As used in this section, “security” means any payment, fee, deposit, or charge, including, but not limited to, any payment, fee, deposit, or charge, except as provided in Section 1950.6, that is imposed at the beginning of the tenancy to be used to reimburse the landlord for costs associated with processing a new tenant or that is imposed as an advance payment of rent, used or to be used for any purpose, including, but not limited to, any of the following:\n\n(1) The compensation of a landlord for a tenant’s default in the payment of rent.\n\n(2) The repair of damages to the premises, exclusive of ordinary wear and tear, caused by the tenant or by a guest or licensee of the tenant.\n\n(3) The cleaning of the premises upon termination of the tenancy necessary to return the unit to the same level of cleanliness it was in at the inception of the tenancy. The amendments to this paragraph enacted by the act adding this sentence shall apply only to tenancies for which the tenant’s right to occupy begins after January 1, 2003.\n\n(4) To remedy future defaults by the tenant in any obligation under the rental agreement to restore, replace, or return personal property or appurtenances, exclusive of ordinary wear and tear, if the security deposit is authorized to be applied thereto by the rental agreement.\n\n(c) (1) Except as provided in paragraph (2), (3), or (5), a landlord shall not demand or receive security, however denominated, in an amount or value in excess of an amount equal to one month’s rent, in addition to any rent for the first month paid on or before initial occupancy.\n\n(2) This subdivision does not prohibit an advance payment of not less than six months’ rent if the term of the lease is six months or longer.\n\n(3) This subdivision does not preclude a landlord and a tenant from entering into a mutual agreement for the landlord, at the request of the tenant and for a specified fee or charge, to make structural, decorative, furnishing, or other similar alterations, if the alterations are other than cleaning or repairing for which the landlord may charge the previous tenant as provided by subdivision (e).\n\n(4) On or after April 1, 2025, if a landlord or its agent charges a service member who rents residential property in which the service member will reside a higher than standard or advertised security pursuant to paragraph (1) due to the credit history, credit score, housing history, or other factor related to the tenant, the landlord shall provide the tenant with a written statement, on or before the date the lease is signed, of the amount of the higher security and an explanation why the higher security amount is being charged. The additional amount of security shall be returned to the tenant after no more than six months of residency if the tenant is not in arrears for any rent due during that period. The date for return of the additional amount of security shall be included in the lease agreement. For purposes of this paragraph, “service member” has the same meaning as in Section 400 of the Military and Veterans Code.\n\n(5) (A) Notwithstanding paragraph (1), a landlord shall not demand or receive security, however denominated, in an amount or value in excess of an amount equal to two months’ rent, in addition to any rent for the first month paid on or before initial occupancy if the landlord meets both of the following requirements:\n\n(i) The landlord is a natural person or a limited liability company in which all members are natural persons.\n\n(ii) The landlord owns no more than two residential rental properties that collectively include no more than four dwelling units offered for rent.\n\n(B) Subparagraph (A) shall not apply if the prospective tenant is a service member. A landlord shall not refuse to enter into a rental agreement for residential property with a prospective tenant who is a service member because this subparagraph prohibits the landlord from demanding or receiving a greater amount of security than that which is established in paragraph (1). For purposes of this subparagraph, “service member” has the same meaning as in Section 400 of the Military and Veterans Code.\n\n(C) For purposes of this paragraph:\n\n(i) “Natural person” includes any natural person who is a settlor or beneficiary of a family trust.\n\n(ii) “Family trust” means a revocable living trust or irrevocable trust in which the settlors and beneficiaries of the trust are persons who are related to each other as sibling, spouse, domestic partner, child, parent, grandparent, or grandchild.\n\n(6) This subdivision shall not apply to a security collected or demanded by the landlord before July 1, 2024.\n\n(d) Any security shall be held by the landlord for the tenant who is party to the lease or agreement. The claim of a tenant to the security shall be prior to the claim of any creditor of the landlord.\n\n(e) (1) Subjec",
          "scraped": "2026-01-26T02:29:02.526Z",
          "title": "Security deposit rules",
          "keywords": ["security deposit", "refund", "deductions"]
        },
        {
          "code": "CIV",
          "section": "1950.7",
          "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=CIV&sectionNum=1950.7",
          "text": "(a) Any payment or deposit of money the primary function of which is to secure the performance of a rental agreement for other than residential property or any part of the agreement, other than a payment or deposit, including an advance payment of rent, made to secure the execution of a rental agreement, shall be governed by the provisions of this section. With respect to residential property, the provisions of Section 1950.5 shall prevail.\n\n(b) The payment or deposit of money shall be held by the landlord for the tenant who is party to the agreement. The claim of a tenant to the payment or deposit shall be prior to the claim of any creditor of the landlord, except a trustee in bankruptcy.\n\n(c) The landlord may claim of the payment or deposit only those amounts as are reasonably necessary to remedy tenant defaults in the payment of rent, to repair damages to the premises caused by the tenant, or to clean the premises upon termination of the tenancy, if the payment or deposit is made for any or all of those specific purposes.\n\n(1) If the claim of the landlord upon the payment or deposit is only for defaults in the payment of rent and the security deposit equals no more than one month’s rent plus a deposit amount clearly described as the payment of the last month’s rent, then any remaining portion of the payment or deposit shall be returned to the tenant at a time as may be mutually agreed upon by landlord and tenant, but in no event later than 30 days from the date the landlord receives possession of the premises.\n\n(2) If the claim of the landlord upon the payment or deposit is only for defaults in the payment of rent and the security deposit exceeds the amount of one month’s rent plus a deposit amount clearly described as the payment of the last month’s rent, then any remaining portion of the payment or deposit in excess of an amount equal to one month’s rent shall be returned to the tenant no later than two weeks after the date the landlord receives possession of the premises, with the remainder to be returned or accounted for within 30 days from the date the landlord receives possession of the premises.\n\n(3) If the claim of the landlord upon the payment or deposit includes amounts reasonably necessary to repair damages to the premises caused by the tenant or to clean the premises, then any remaining portion of the payment or deposit shall be returned to the tenant at a time as may be mutually agreed upon by landlord and tenant, but in no event later than 30 days from the date the landlord receives possession of the premises.\n\n(d) Upon termination of the landlord’s interest in the unit in question, whether by sale, assignment, death, appointment of receiver or otherwise, the landlord or the landlord’s agent shall, within a reasonable time, do one of the following acts, either of which shall relieve the landlord of further liability with respect to the payment or deposit:\n\n(1) Transfer the portion of the payment or deposit remaining after any lawful deductions made under subdivision (c) to the landlord’s successor in interest, and thereafter notify the tenant by personal delivery or certified mail of the transfer, of any claims made against the payment or deposit, and of the transferee’s name and address. If the notice to the tenant is made by personal delivery, the tenant shall acknowledge receipt of the notice and sign his or her name on the landlord’s copy of the notice.\n\n(2) Return the portion of the payment or deposit remaining after any lawful deductions made under subdivision (c) to the tenant.\n\n(e) Upon receipt of any portion of the payment or deposit under paragraph (1) of subdivision (d), the transferee shall have all of the rights and obligations of a landlord holding the payment or deposit with respect to the payment or deposit.\n\n(f) The bad faith retention by a landlord or transferee of a payment or deposit or any portion thereof, in violation of this section, may subject the landlord or the transferee to damages not to exceed two hundred dollars ($200), in addition to any actual damages.\n\n(g) This section is declarative of existing law and therefore operative as to all tenancies, leases, or rental agreements for other than residential property created or renewed on or after January 1, 1971.",
          "scraped": "2026-01-26T02:29:03.129Z",
          "title": "Last month rent as deposit",
          "keywords": ["last month", "deposit"]
        },
        {
          "code": "CIV",
          "section": "1954",
          "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=CIV&sectionNum=1954",
          "text": "(a) A landlord may enter the dwelling unit only in the following cases:\n\n(1) In case of emergency.\n\n(2) To make necessary or agreed repairs, decorations, alterations or improvements, supply necessary or agreed services, or exhibit the dwelling unit to prospective or actual purchasers, mortgagees, tenants, workers, or contractors or to make an inspection pursuant to subdivision (f) of Section 1950.5.\n\n(3) When the tenant has abandoned or surrendered the premises.\n\n(4) Pursuant to court order.\n\n(5) For the purposes set forth in Chapter 2.5 (commencing with Section 1954.201).\n\n(6) To comply with the provisions of Article 2.2 (commencing with Section 17973) of Chapter 5 of Part 1.5 of Division 13 of the Health and Safety Code.\n\n(b) Except in cases of emergency or when the tenant has abandoned or surrendered the premises, entry may not be made during other than normal business hours unless the tenant consents to an entry during other than normal business hours at the time of entry.\n\n(c) The landlord may not abuse the right of access or use it to harass the tenant.\n\n(d) (1) Except as provided in subdivision (e), or as provided in paragraph (2) or (3), the landlord shall give the tenant reasonable notice in writing of his or her intent to enter and enter only during normal business hours. The notice shall include the date, approximate time, and purpose of the entry. The notice may be personally delivered to the tenant, left with someone of a suitable age and discretion at the premises, or, left on, near, or under the usual entry door of the premises in a manner in which a reasonable person would discover the notice. Twenty-four hours shall be presumed to be reasonable notice in absence of evidence to the contrary. The notice may be mailed to the tenant. Mailing of the notice at least six days prior to an intended entry is presumed reasonable notice in the absence of evidence to the contrary.\n\n(2) If the purpose of the entry is to exhibit the dwelling unit to prospective or actual purchasers, the notice may be given orally, in person or by telephone, if the landlord or his or her agent has notified the tenant in writing within 120 days of the oral notice that the property is for sale and that the landlord or agent may contact the tenant orally for the purpose described above. Twenty-four hours is presumed reasonable notice in the absence of evidence to the contrary. The notice shall include the date, approximate time, and purpose of the entry. At the time of entry, the landlord or agent shall leave written evidence of the entry inside the unit.\n\n(3) The tenant and the landlord may agree orally to an entry to make agreed repairs or supply agreed services. The agreement shall include the date and approximate time of the entry, which shall be within one week of the agreement. In this case, the landlord is not required to provide the tenant a written notice.\n\n(e) No notice of entry is required under this section:\n\n(1) To respond to an emergency.\n\n(2) If the tenant is present and consents to the entry at the time of entry.\n\n(3) After the tenant has abandoned or surrendered the unit.",
          "scraped": "2026-01-26T02:29:03.748Z",
          "title": "Landlord right of access",
          "keywords": ["landlord access", "entry", "24 hours"]
        }
      ]
    },
    "LAB": {
      "name": "Labor Code",
      "sections": [
        {
          "code": "LAB",
          "section": "201",
          "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=LAB&sectionNum=201",
          "text": "(a) If an employer discharges an employee, the wages earned and unpaid at the time of discharge are due and payable immediately. An employer who lays off a group of employees by reason of the termination of seasonal employment in the curing, canning, or drying of any variety of perishable fruit, fish, or vegetables, shall be deemed to have made immediate payment when the wages of said employees are paid within a reasonable time as necessary for computation and payment thereof; provided, however, that the reasonable time shall not exceed 72 hours, and further provided that payment shall be made by mail to any employee who so requests and designates a mailing address therefor.\n\n(b) Notwithstanding any other law, the state employer shall be deemed to have made an immediate payment of wages under this section for any unused or accumulated vacation, annual leave, holiday leave, or time off to which the employee is entitled by reason of previous overtime work where compensating time off was given by the appointing power, provided, at least five workdays prior to his or her final day of employment, the employee submits a written election to his or her appointing power authorizing the state employer to tender payment for any or all leave to be contributed on a pretax basis or a Roth basis, in the year of discharge, to the employee’s account in a state-sponsored supplemental retirement plan as described under Sections 401(k), 403(b), or 457 of the Internal Revenue Code provided the plan allows those contributions. The contribution shall be deposited into the employee’s 401(k), 403(b), or 457 plan account no later than two and one-half months after the employee’s discharge from employment. This section is not intended to authorize contributions in excess of the annual deferral limits imposed under federal and state law or the provisions of the supplemental retirement plan itself.\n\n(c) Notwithstanding any other law, when the state employer discharges an employee, the employee may, at least five workdays prior to his or her final day of employment, submit a written election to his or her appointing power authorizing the state employer to defer into the next calendar year payment of any or all of the employee’s unused or accumulated vacation, annual leave, holiday leave, or time off to which the employee is entitled by reason of previous overtime work where compensating time off was given by the appointing power. An employee electing to defer payment into the next calendar year under this section may do any of the following:\n\n(1) Contribute the entire payment to his or her 401(k), 403(b), or 457 plan account.\n\n(A) This election is only available if the employee is terminated from service on or after November 1 of the calendar year of his or her termination.\n\n(B) The contributions shall be deposited into an applicable plan account no later than two and one-half months after the employee’s last day of employment.\n\n(2) Contribute any portion of the deferred payment to his or her 401(k), 403(b), or 457 plan account and receive cash payment for the remaining noncontributed unused leave.\n\n(A) An employee is eligible to defer a portion of the deferred payment into a 401(k), 403(b), or 457 plan account only if the employee’s date of termination from service was on or after November 1 of the calendar year of his or her termination.\n\n(B) For the portion deferred into a 401(k), 403(b), or 457 plan account, the contributions shall be deposited into an applicable plan account no later than two and one-half months after the employee’s last day of employment.\n\n(C) For the portion received as a cash payment:\n\n(i) Only that portion of leave that extends past the November pay period for the employee shall be deferred into the next calendar year.\n\n(ii) Payments shall be tendered under this paragraph no later than February 1 in the year following the employee’s last day of employment.\n\n(3) Receive a lump-sum payment for all of the deferred unused leave as described above.\n\n(A) Only that portion of leave that extends past the November pay period for the employee shall be deferred into the next calendar year.\n\n(B) Payments shall be tendered under this paragraph no later than February 1 in the year following the employee’s last day of employment.\n\n(d) This section is not intended to authorize contributions in excess of the annual deferral limits imposed under federal and state law or the provisions of the supplemental retirement plan itself.",
          "scraped": "2026-01-26T02:29:04.338Z",
          "title": "Final wages - discharge",
          "keywords": ["final paycheck", "fired", "terminated"]
        },
        {
          "code": "LAB",
          "section": "202",
          "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=LAB&sectionNum=202",
          "text": "(a) If an employee not having a written contract for a definite period quits his or her employment, his or her wages shall become due and payable not later than 72 hours thereafter, unless the employee has given 72 hours previous notice of his or her intention to quit, in which case the employee is entitled to his or her wages at the time of quitting. Notwithstanding any other law, an employee who quits without providing a 72-hour notice shall be entitled to receive payment by mail if he or she so requests and designates a mailing address. The date of the mailing shall constitute the date of payment for purposes of the requirement to provide payment within 72 hours of the notice of quitting.\n\n(b) Notwithstanding any other law, the state employer shall be deemed to have made an immediate payment of wages under this section for any unused or accumulated vacation, annual leave, holiday leave, sick leave to which the employee is otherwise entitled due to a disability retirement, or time off to which the employee is entitled by reason of previous overtime work where compensating time off was given by the appointing power, provided at least five workdays prior to his or her final day of employment, the employee submits a written election to his or her appointing power authorizing the state employer to tender payment for any or all leave to be contributed on a pretax basis or a Roth basis, in the year of separation, to the employee’s account in a state-sponsored supplemental retirement plan as described under Sections 401(k), 403(b), or 457 of the Internal Revenue Code provided the plan allows those contributions. The contribution shall be deposited into the employee’s 401(k), 403(b), or 457 plan account no later than two and one-half months after the employee’s final day of employment. This section is not intended to authorize contributions in excess of the annual deferral limits imposed under federal and state law or the provisions of the supplemental retirement plan itself.\n\n(c) Notwithstanding any other law, when a state employee quits, retires, or disability retires from his or her employment with the state, the employee may, at least five workdays prior to his or her final day of employment, submit a written election to his or her appointing power authorizing the state employer to defer into the next calendar year payment of any or all of the employee’s unused or accumulated vacation, annual leave, holiday leave, sick leave to which the employee is otherwise entitled due to a disability, retirement, or time off to which the employee is entitled by reason of previous overtime work where compensating time off was given by the appointing power. The employee may elect any of the following:\n\n(1) Contribute the entire payment to his or her 401(k), 403(b), or 457 plan account.\n\n(A) This election is only available if the employee’s last day of employment is on or after November 1 of the calendar year of his or her last day of employment.\n\n(B) The contributions shall be deposited into the applicable plan account no later than two and one-half months after the employee’s last day of employment.\n\n(2) Contribute any portion of the deferred payment to his or her 401(k), 403(b), or 457 plan account and receive cash payment for the remaining noncontributed unused leave.\n\n(A) An employee is eligible to defer a portion of the deferred payment into a 401(k), 403(b), or 457 plan account only if the employee’s last day of employment was on or after November 1 of the calendar year of his or her last day of employment.\n\n(B) For the portion deferred into a 401(k), 403(b), or 457 plan account, the contributions shall be deposited into an applicable plan account no later than two and one-half months after the employee’s last day of employment.\n\n(C) For the portion received as a cash payment:\n\n(i) Only that portion of leave that extends past the November pay period for the employee shall be deferred into the next calendar year.\n\n(ii) Payments shall be tendered under this paragraph no later than February 1 in the year following the employee’s last day of employment.\n\n(3) Receive a lump-sum payment for all of the deferred unused leave as described above.\n\n(A) Only that portion of leave that extends past the November pay period for the employee shall be deferred into the next calendar year.\n\n(B) Payments shall be tendered under this section no later than February 1 in the year following the employee’s last day of employment.\n\n(d) This section is not intended to authorize contributions in excess of the annual deferral limits imposed under federal and state law or the provisions of the supplemental retirement plan itself.",
          "scraped": "2026-01-26T02:29:04.926Z",
          "title": "Final wages - quit",
          "keywords": ["final paycheck", "quit", "resignation"]
        },
        {
          "code": "LAB",
          "section": "203",
          "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=LAB&sectionNum=203",
          "text": "(a) If an employer willfully fails to pay, without abatement or reduction, in accordance with Sections 201, 201.3, 201.5, 201.6, 201.8, 201.9, 202, and 205.5, any wages of an employee who is discharged or who quits, the wages of the employee shall continue as a penalty from the due date thereof at the same rate until paid or until an action therefor is commenced; but the wages shall not continue for more than 30 days. An employee who secretes or absents themselves to avoid payment to them, or who refuses to receive the payment when fully tendered to them, including any penalty then accrued under this section, is not entitled to any benefit under this section for the time during which the employee so avoids payment.\n\n(b) Suit may be filed for these penalties at any time before the expiration of the statute of limitations on an action for the wages from which the penalties arise.",
          "scraped": "2026-01-26T02:29:05.516Z",
          "title": "Penalty for late wages",
          "keywords": ["waiting time penalty", "late pay"]
        },
        {
          "code": "LAB",
          "section": "226",
          "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=LAB&sectionNum=226",
          "text": "(a) An employer, semimonthly or at the time of each payment of wages, shall furnish to their employee, either as a detachable part of the check, draft, or voucher paying the employee’s wages, or separately if wages are paid by personal check or cash, an accurate itemized statement in writing showing (1) gross wages earned, (2) total hours worked by the employee, except as provided in subdivision (j), (3) the number of piece-rate units earned and any applicable piece rate if the employee is paid on a piece-rate basis, (4) all deductions, provided that all deductions made on written orders of the employee may be aggregated and shown as one item, (5) net wages earned, (6) the inclusive dates of the period for which the employee is paid, (7) the name of the employee and only the last four digits of their social security number or an employee identification number other than a social security number, (8) the name and address of the legal entity that is the employer and, if the employer is a farm labor contractor, as defined in subdivision (b) of Section 1682, the name and address of the legal entity that secured the services of the employer, and (9) all applicable hourly rates in effect during the pay period and the corresponding number of hours worked at each hourly rate by the employee and, beginning July 1, 2013, if the employer is a temporary services employer as defined in Section 201.3, the rate of pay and the total hours worked for each temporary services assignment. The deductions made from payment of wages shall be recorded in ink or other indelible form, properly dated, showing the month, day, and year, and a copy of the statement and the record of the deductions shall be kept on file by the employer for at least three years at the place of employment or at a central location within the State of California. For purposes of this subdivision, “copy” includes a duplicate of the itemized statement provided to an employee or a computer-generated record that accurately shows all of the information required by this subdivision.\n\n(b) An employer that is required by this code or any regulation adopted pursuant to this code to keep the information required by subdivision (a) shall afford current and former employees the right to inspect or receive a copy of records pertaining to their employment, upon reasonable request to the employer. The employer may take reasonable steps to ensure the identity of a current or former employee. If the employer provides copies of the records, the actual cost of reproduction may be charged to the current or former employee.\n\n(c) An employer who receives a written or oral request to inspect or receive a copy of records pursuant to subdivision (b) pertaining to a current or former employee shall comply with the request as soon as practicable, but no later than 21 calendar days from the date of the request. A violation of this subdivision is an infraction. Impossibility of performance, not caused by or a result of a violation of law, shall be an affirmative defense for an employer in any action alleging a violation of this subdivision. An employer may designate the person to whom a request under this subdivision will be made.\n\n(d) This section does not apply to any employer of a person employed by the owner or occupant of a residential dwelling whose duties are incidental to the ownership, maintenance, or use of the dwelling, including the care and supervision of children, or whose duties are personal and not in the course of the trade, business, profession, or occupation of the owner or occupant.\n\n(e) (1) An employee suffering injury as a result of a knowing and intentional failure by an employer to comply with subdivision (a) is entitled to recover the greater of all actual damages or fifty dollars ($50) for the initial pay period in which a violation occurs and one hundred dollars ($100) per employee for each violation in a subsequent pay period, not to exceed an aggregate penalty of four thousand dollars ($4,000), and is entitled to an award of costs and reasonable attorney’s fees.\n\n(2) (A) An employee is deemed to suffer injury for purposes of this subdivision if the employer fails to provide a wage statement.\n\n(B) An employee is deemed to suffer injury for purposes of this subdivision if the employer fails to provide accurate and complete information as required by any one or more of items (1) to (9), inclusive, of subdivision (a) and the employee cannot promptly and easily determine from the wage statement alone one or more of the following:\n\n(i) The amount of the gross wages or net wages paid to the employee during the pay period or any of the other information required to be provided on the itemized wage statement pursuant to items (2) to (4), inclusive, (6), and (9) of subdivision (a).\n\n(ii) Which deductions the employer made from gross wages to determine the net wages paid to the employee during the pay period. Nothing in this subdivision alters the ability of the employ",
          "scraped": "2026-01-26T02:29:06.122Z",
          "title": "Pay stub requirements",
          "keywords": ["pay stub", "itemized statement"]
        },
        {
          "code": "LAB",
          "section": "246",
          "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=LAB&sectionNum=246",
          "text": "(a) (1) An employee who, on or after July 1, 2015, works in California for the same employer for 30 or more days within a year from the commencement of employment is entitled to paid sick days as specified in this section. For an individual provider of waiver personal care services under Section 14132.97 of the Welfare and Institutions Code who also provides in-home supportive services in an applicable month, eligibility shall be determined based on the aggregate number of monthly hours worked between in-home supportive services and waiver personal care services pursuant to subdivision (d) of Section 14132.971.\n\n(2) On and after July 1, 2018, a provider of in-home supportive services under Section 14132.95, 14132.952, or 14132.956 of, or Article 7 (commencing with Section 12300) of Chapter 3 of Part 3 of Division 9 of, the Welfare and Institutions Code, who works in California for 30 or more days within a year from the commencement of employment is entitled to paid sick days as specified in subdivision (e) and subject to the rate of accrual in paragraph (1) of subdivision (b). For an individual provider of waiver personal care services under Section 14132.97 of the Welfare and Institutions Code, entitlement to paid sick days begins on July 1, 2019.\n\n(b) (1) An employee shall accrue paid sick days at the rate of not less than one hour per every 30 hours worked, beginning at the commencement of employment or the operative date of this article, whichever is later, subject to the use and accrual limitations set forth in this section.\n\n(2) An employee who is exempt from overtime requirements as an administrative, executive, or professional employee under a wage order of the Industrial Welfare Commission is deemed to work 40 hours per workweek for the purposes of this section, unless the employee’s normal workweek is less than 40 hours, in which case the employee shall accrue paid sick days based upon that normal workweek.\n\n(3) An employer may use a different accrual method, other than providing one hour per every 30 hours worked, provided that the accrual is on a regular basis so that an employee has no less than 24 hours of accrued sick leave or paid time off by the 120th calendar day of employment or each calendar year, or in each 12-month period, and no less than 40 hours of accrued sick leave or paid time off by the 200th calendar day of employment or each calendar year, or in each 12-month period.\n\n(4) An employer may satisfy the accrual requirements of this section by providing not less than 24 hours or 3 days of paid sick leave that is available to the employee to use by the completion of the employee’s 120th calendar day of employment, and no less than 40 hours or 5 days of paid sick leave that is available to the employee to use by the completion of the employee’s 200th calendar day of employment.\n\n(c) An employee shall be entitled to use accrued paid sick days beginning on the 90th day of employment, after which day the employee may use paid sick days as they are accrued.\n\n(d) Accrued paid sick days shall carry over to the following year of employment. However, an employer may limit an employee’s use of accrued paid sick days to 40 hours or five days in each year of employment, calendar year, or 12-month period. This section shall be satisfied and no accrual or carryover is required if the full amount of leave is received at the beginning of each year of employment, calendar year, or 12-month period. The term “full amount of leave” means five days or 40 hours.\n\n(e) For a provider of in-home supportive services under Section 14132.95, 14132.952, or 14132.956 of, or Article 7 (commencing with Section 12300) of Chapter 3 of Part 3 of Division 9 of, and an individual provider of waiver personal care services under Section 14132.97 of, the Welfare and Institutions Code, the term “full amount of leave” is defined as follows:\n\n(1) Eight hours or one day in each year of employment, calendar year, or 12-month period beginning July 1, 2018.\n\n(2) Sixteen hours or two days in each year of employment, calendar year, or 12-month period beginning when the minimum wage, as set forth in paragraph (1) of subdivision (b) of Section 1182.12 and accounting for any years postponed under subparagraph (D) of paragraph (3) of subdivision (d) of Section 1182.12, has reached thirteen dollars ($13) per hour.\n\n(3) Twenty-four hours or three days in each year of employment, calendar year, or 12-month period beginning when the minimum wage, as set forth in paragraph (1) of subdivision (b) of Section 1182.12 and accounting for any years postponed under subparagraph (D) of paragraph (3) of subdivision (d) of Section 1182.12, has reached fifteen dollars ($15) per hour.\n\n(4) Forty hours or five days in each year of employment, calendar year, or 12-month period beginning January 1, 2024.\n\n(f) An employer is not required to provide additional paid sick days pursuant to this section if the employer has a paid leave policy or paid time off ",
          "scraped": "2026-01-26T02:29:06.733Z",
          "title": "Paid sick leave",
          "keywords": ["sick leave", "paid sick", "illness"]
        },
        {
          "code": "LAB",
          "section": "510",
          "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=LAB&sectionNum=510",
          "text": "(a) Eight hours of labor constitutes a day’s work. Any work in excess of eight hours in one workday and any work in excess of 40 hours in any one workweek and the first eight hours worked on the seventh day of work in any one workweek shall be compensated at the rate of no less than one and one-half times the regular rate of pay for an employee. Any work in excess of 12 hours in one day shall be compensated at the rate of no less than twice the regular rate of pay for an employee. In addition, any work in excess of eight hours on any seventh day of a workweek shall be compensated at the rate of no less than twice the regular rate of pay of an employee. Nothing in this section requires an employer to combine more than one rate of overtime compensation in order to calculate the amount to be paid to an employee for any hour of overtime work. The requirements of this section do not apply to the payment of overtime compensation to an employee working pursuant to any of the following:\n\n(1) An alternative workweek schedule adopted pursuant to Section 511.\n\n(2) An alternative workweek schedule adopted pursuant to a collective bargaining agreement pursuant to Section 514.\n\n(3) An alternative workweek schedule to which this chapter is inapplicable pursuant to Section 554.\n\n(b) Time spent commuting to and from the first place at which an employee’s presence is required by the employer shall not be considered to be a part of a day’s work, when the employee commutes in a vehicle that is owned, leased, or subsidized by the employer and is used for the purpose of ridesharing, as defined in Section 522 of the Vehicle Code.\n\n(c) This section does not affect, change, or limit an employer’s liability under the workers’ compensation law.",
          "scraped": "2026-01-26T02:29:07.318Z",
          "title": "Overtime requirements",
          "keywords": ["overtime", "hours", "time and half"]
        },
        {
          "code": "LAB",
          "section": "512",
          "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=LAB&sectionNum=512",
          "text": "(a) An employer shall not employ an employee for a work period of more than five hours per day without providing the employee with a meal period of not less than 30 minutes, except that if the total work period per day of the employee is no more than six hours, the meal period may be waived by mutual consent of both the employer and employee. An employer shall not employ an employee for a work period of more than 10 hours per day without providing the employee with a second meal period of not less than 30 minutes, except that if the total hours worked is no more than 12 hours, the second meal period may be waived by mutual consent of the employer and the employee only if the first meal period was not waived.\n\n(b) (1) Notwithstanding subdivision (a), the Industrial Welfare Commission may adopt a working condition order permitting a meal period to commence after six hours of work if the commission determines that the order is consistent with the health and welfare of the affected employees.\n\n(2) Notwithstanding paragraph (1), a commercial driver employed by a motor carrier transporting nutrients and byproducts from a commercial feed manufacturer subject to Section 15051 of the Food and Agricultural Code to a customer located in a remote rural location may commence a meal period after six hours of work, if the regular rate of pay of the driver is no less than one and one-half times the state minimum wage and the driver receives overtime compensation in accordance with Section 510.\n\n(c) Subdivision (a) does not apply to an employee in the wholesale baking industry who is subject to an Industrial Welfare Commission wage order and who is covered by a valid collective bargaining agreement that provides for a 35-hour workweek consisting of five 7-hour days, payment of one and one-half times the regular rate of pay for time worked in excess of seven hours per day, and a rest period of not less than 10 minutes every two hours.\n\n(d) If an employee in the motion picture industry or the broadcasting industry, as those industries are defined in Industrial Welfare Commission Wage Order Numbers 11 and 12, is covered by a valid collective bargaining agreement that provides for meal periods and includes a monetary remedy if the employee does not receive a meal period required by the agreement, then the terms, conditions, and remedies of the agreement pertaining to meal periods apply in lieu of the applicable provisions pertaining to meal periods of subdivision (a) of this section, Section 226.7, and Industrial Welfare Commission Wage Order Numbers 11 and 12.\n\n(e) Subdivisions (a) and (b) do not apply to an employee specified in subdivision (f) if both of the following conditions are satisfied:\n\n(1) The employee is covered by a valid collective bargaining agreement.\n\n(2) The valid collective bargaining agreement expressly provides for the wages, hours of work, and working conditions of employees, and expressly provides for meal periods for those employees, final and binding arbitration of disputes concerning application of its meal period provisions, premium wage rates for all overtime hours worked, and a regular hourly rate of pay of not less than 30 percent more than the state minimum wage rate.\n\n(f) Subdivision (e) applies to each of the following employees:\n\n(1) An employee employed in a construction occupation.\n\n(2) An employee employed as a commercial driver.\n\n(3) An employee employed in the security services industry as a security officer who is registered pursuant to Chapter 11.5 (commencing with Section 7580) of Division 3 of the Business and Professions Code, and who is employed by a private patrol operator registered pursuant to that chapter.\n\n(4) An employee employed by an electrical corporation, a gas corporation, a water corporation, or a local publicly owned electric utility.\n\n(g) The following definitions apply for the purposes of this section:\n\n(1) “Commercial driver” means an employee who operates a vehicle described in Section 260 or 462 of, or subdivision (b) of Section 15210 of, the Vehicle Code.\n\n(2) “Construction occupation” means all job classifications associated with construction by Article 2 (commencing with Section 7025) of Chapter 9 of Division 3 of the Business and Professions Code, including work involving alteration, demolition, building, excavation, renovation, remodeling, maintenance, improvement, and repair, and any other similar or related occupation or trade.\n\n(3) “Electrical corporation” has the same meaning as provided in Section 218 of the Public Utilities Code.\n\n(4) “Gas corporation” has the same meaning as provided in Section 222 of the Public Utilities Code.\n\n(5) “Local publicly owned electric utility” has the same meaning as provided in Section 224.3 of the Public Utilities Code.\n\n(6) “Water corporation” has the same meaning as provided in Section 241 of the Public Utilities Code.",
          "scraped": "2026-01-26T02:29:07.926Z",
          "title": "Meal periods",
          "keywords": ["meal break", "lunch", "30 minutes"]
        },
        {
          "code": "LAB",
          "section": "1194",
          "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=LAB&sectionNum=1194",
          "text": "(a) Notwithstanding any agreement to work for a lesser wage, any employee receiving less than the legal minimum wage or the legal overtime compensation applicable to the employee is entitled to recover in a civil action the unpaid balance of the full amount of this minimum wage or overtime compensation, including interest thereon, reasonable attorney’s fees, and costs of suit.\n\n(b) The amendments made to this section by Chapter 825 of the Statutes of 1991 shall apply only to civil actions commenced on or after January 1, 1992.",
          "scraped": "2026-01-26T02:29:08.516Z",
          "title": "Minimum wage recovery",
          "keywords": ["minimum wage", "underpaid"]
        },
        {
          "code": "LAB",
          "section": "1197",
          "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=LAB&sectionNum=1197",
          "text": "The minimum wage for employees fixed by the commission or by any applicable state or local law, is the minimum wage to be paid to employees, and the payment of a lower wage than the minimum so fixed is unlawful. This section does not change the applicability of local minimum wage laws to any entity.",
          "scraped": "2026-01-26T02:29:09.111Z",
          "title": "Minimum wage requirement",
          "keywords": ["minimum wage", "hourly rate"]
        },
        {
          "code": "LAB",
          "section": "2802",
          "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=LAB&sectionNum=2802",
          "text": "(a) An employer shall indemnify his or her employee for all necessary expenditures or losses incurred by the employee in direct consequence of the discharge of his or her duties, or of his or her obedience to the directions of the employer, even though unlawful, unless the employee, at the time of obeying the directions, believed them to be unlawful.\n\n(b) All awards made by a court or by the Division of Labor Standards Enforcement for reimbursement of necessary expenditures under this section shall carry interest at the same rate as judgments in civil actions. Interest shall accrue from the date on which the employee incurred the necessary expenditure or loss.\n\n(c) For purposes of this section, the term “necessary expenditures or losses” shall include all reasonable costs, including, but not limited to, attorney’s fees incurred by the employee enforcing the rights granted by this section.\n\n(d) In addition to recovery of penalties under this section in a court action or proceedings pursuant to Section 98, the commissioner may issue a citation against an employer or other person acting on behalf of the employer who violates reimbursement obligations for an amount determined to be due to an employee under this section. The procedures for issuing, contesting, and enforcing judgments for citations or civil penalties issued by the commissioner shall be the same as those set forth in Section 1197.1. Amounts recovered pursuant to this section shall be paid to the affected employee.",
          "scraped": "2026-01-26T02:29:09.721Z",
          "title": "Expense reimbursement",
          "keywords": ["expense", "reimbursement", "mileage"]
        }
      ]
    },
    "FAM": {
      "name": "Family Code",
      "sections": [
        {
          "code": "FAM",
          "section": "2100",
          "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=FAM&sectionNum=2100",
          "text": "The Legislature finds and declares the following:\n\n(a) It is the policy of the State of California (1) to marshal, preserve, and protect community and quasi-community assets and liabilities that exist at the date of separation so as to avoid dissipation of the community estate before distribution, (2) to ensure fair and sufficient child and spousal support awards, and (3) to achieve a division of community and quasi-community assets and liabilities on the dissolution or nullity of marriage or legal separation of the parties as provided under California law.\n\n(b) Sound public policy further favors the reduction of the adversarial nature of marital dissolution and the attendant costs by fostering full disclosure and cooperative discovery.\n\n(c) In order to promote this public policy, a full and accurate disclosure of all assets and liabilities in which one or both parties have or may have an interest must be made in the early stages of a proceeding for dissolution of marriage or legal separation of the parties, regardless of the characterization as community or separate, together with a disclosure of all income and expenses of the parties. Moreover, each party has a continuing duty to immediately, fully, and accurately update and augment that disclosure to the extent there have been any material changes so that at the time the parties enter into an agreement for the resolution of any of these issues, or at the time of trial on these issues, each party will have a full and complete knowledge of the relevant underlying facts.",
          "scraped": "2026-01-26T02:29:10.323Z",
          "title": "Disclosure requirements",
          "keywords": ["divorce", "disclosure", "assets"]
        },
        {
          "code": "FAM",
          "section": "3020",
          "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=FAM&sectionNum=3020",
          "text": "(a) The Legislature finds and declares that it is the public policy of this state to ensure that the health, safety, and welfare of children shall be the court’s primary concern in determining the best interests of children when making any orders regarding the physical or legal custody or visitation of children. The Legislature further finds and declares that children have the right to be safe and free from abuse, and that the perpetration of child abuse or domestic violence in a household where a child resides is detrimental to the health, safety, and welfare of the child.\n\n(b) The Legislature finds and declares that it is the public policy of this state to ensure that children have frequent and continuing contact with both parents after the parents have separated or dissolved their marriage, or ended their relationship, and to encourage parents to share the rights and responsibilities of child rearing in order to effect this policy, except when the contact would not be in the best interests of the child, as provided in subdivisions (a) and (c) of this section and Section 3011.\n\n(c) When the policies set forth in subdivisions (a) and (b) of this section are in conflict, a court’s order regarding physical or legal custody or visitation shall be made in a manner that ensures the health, safety, and welfare of the child and the safety of all family members.\n\n(d) The Legislature finds and declares that it is the public policy of this state to ensure that the sex, gender identity, gender expression, or sexual orientation of a parent, legal guardian, or relative is not considered in determining the best interests of the child.",
          "scraped": "2026-01-26T02:29:10.934Z",
          "title": "Best interest of child",
          "keywords": ["child custody", "best interest"]
        },
        {
          "code": "FAM",
          "section": "3040",
          "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=FAM&sectionNum=3040",
          "text": "(a) Custody should be granted in the following order of preference according to the best interest of the child as provided in Sections 3011 and 3020:\n\n(1) To both parents jointly pursuant to Chapter 4 (commencing with Section 3080) or to either parent. In making an order granting custody to either parent, the court shall consider, among other factors, which parent is more likely to allow the child frequent and continuing contact with the noncustodial parent, consistent with Sections 3011 and 3020. The court, in its discretion, may require the parents to submit to the court a plan for the implementation of the custody order.\n\n(2) If to neither parent, to the person or persons in whose home the child has been living in a wholesome and stable environment.\n\n(3) To any other person or persons deemed by the court to be suitable and able to provide adequate and proper care and guidance for the child.\n\n(b) The immigration status of a parent, legal guardian, or relative shall not disqualify the parent, legal guardian, or relative from receiving custody under subdivision (a).\n\n(c) The court shall not consider the sex, gender identity, gender expression, or sexual orientation of a parent, legal guardian, or relative in determining the best interest of the child under subdivision (a).\n\n(d) (1) Commencing January 1, 2024, if a court finds that the effects of a parent’s, legal guardian’s, or relative’s history of or current mental illness are a factor in determining the best interest of the child under subdivision (a), the court shall do both of the following:\n\n(A) Provide the parent, legal guardian, or relative with a list of local resources for mental health treatment.\n\n(B) State its reasons for the finding in writing or on the record.\n\n(2) This subdivision does not relieve a court from ensuring that the health, safety, and welfare of the child is the court’s primary concern in determining the best interests of children when making any order regarding the physical or legal custody, or visitation, of the child.\n\n(e) This section establishes neither a preference nor a presumption for or against joint legal custody, joint physical custody, or sole custody, but allows the court and the family the widest discretion to choose a parenting plan that is in the best interest of the child, consistent with this section.\n\n(f) In cases where a child has more than two parents, the court shall allocate custody and visitation among the parents based on the best interest of the child, including, but not limited to, addressing the child’s need for continuity and stability by preserving established patterns of care and emotional bonds. The court may order that not all parents share legal or physical custody of the child if the court finds that it would not be in the best interest of the child as provided in Sections 3011 and 3020.",
          "scraped": "2026-01-26T02:29:11.540Z",
          "title": "Custody order priorities",
          "keywords": ["custody", "parent", "order"]
        },
        {
          "code": "FAM",
          "section": "3100",
          "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=FAM&sectionNum=3100",
          "text": "(a) In making an order pursuant to Chapter 4 (commencing with Section 3080), the court shall grant reasonable visitation rights to a parent when it is shown that the visitation would be in the best interest of the child, as defined in Section 3011, and consistent with Section 3020. In the discretion of the court, reasonable visitation rights may be granted to any other person having an interest in the welfare of the child.\n\n(b) (1) (A) If a protective order, as defined in Section 6218 of this code or Section 136.2 of the Penal Code, has been issued restraining a parent, the court shall consider whether the best interest of the child requires that visitation by that parent be suspended, denied, or limited to situations in which a third person, specified by the court, is present, including virtual visitation.\n\n(B) A parent may submit to the court the name of a person who the parent deems suitable to be present during visitation.\n\n(C) The court may order supervised visitation with the person whose name was submitted, but the submission of a name does not require the court to order supervised visitation if it is not in the best interest of the child, nor does a parent’s submission of a name constitute agreement or stipulation to supervised visitation.\n\n(2) In determining the type of visitation with the restrained party, if any, is in the best interest of the child pursuant to paragraph (1), the court shall consider the nature of the acts that led to the protective order, the period of time that has elapsed since that order, and whether the restrained party has committed further acts of abuse.\n\n(c) (1) (A) If the court has found that circumstances warrant making an order granting or modifying a custody order on an ex parte basis under Section 3064, the court shall consider whether the best interest of the child requires that visitation by the party whose conduct presents a risk of immediate harm to the child or immediate risk that the child will be removed from the State of California should be suspended, denied, or limited to situations in which a third person, specified by the court, is present, including virtual visitation.\n\n(B) A parent may submit to the court the name of a person who the parent deems suitable to be present during visitation, which may be accepted or rejected by the court as set forth in subparagraph (C) of paragraph (1) of subdivision (b).\n\n(2) In determining the type of visitation with the party whose conduct presents a risk of immediate harm to the child or immediate risk that the child will be removed from the State of California, if any, is in the best interest of the child pursuant to paragraph (1), the court shall consider the nature of the acts that led to the finding of the risk of immediate harm or immediate risk of removal.\n\n(d) If visitation is ordered in a case in which domestic violence is alleged and an emergency protective order, protective order, or other restraining order has been issued, the visitation order shall specify the time, day, place, and manner of the visitation, including virtual visitation, or any transfer of the child, so as to limit the child’s exposure to potential domestic conflict or abuse, to ensure the safety of all family members, and to minimize any opportunity for the use of abuse, including coercive control. If a criminal protective order has been issued pursuant to Section 136.2 of the Penal Code, the visitation order shall make reference to, and, unless there is an emergency protective order that has precedence in enforcement pursuant to paragraph (1) of subdivision (c) of Section 136.2 of the Penal Code or a no-contact order, as described in Section 6320, acknowledge the precedence of enforcement of, an appropriate criminal protective order.\n\n(e) (1) If the court finds a party is staying in a place designated as a shelter for victims of domestic violence or other confidential location, the court’s order shall be designed to prevent disclosure of the location of the shelter or other confidential location and to protect all adults and children living in that location.\n\n(2) If a court finds that a parent is residing in a confidential shelter due to domestic violence or fear of domestic violence from the other parent, the court shall order in-person visitation with the other parent only if the court finds that in-person visitation is in the best interest of the child, taking into account all of the following:\n\n(A) The other parent’s access to firearms and ammunition, including, but not limited to, whether the other parent is prohibited from having firearms and ammunition.\n\n(B) If a parent is the subject of an emergency protective order, protective order, or other restraining order, whether that parent has violated that order, and the nature of any violation.\n\n(C) Information obtained pursuant to Section 6306, the requirements of this section, and the information obtained pursuant to Section 3011.\n\n(D) The potential for disclosure of the confidential l",
          "scraped": "2026-01-26T02:29:12.145Z",
          "title": "Visitation rights",
          "keywords": ["visitation", "parenting time"]
        },
        {
          "code": "FAM",
          "section": "4055",
          "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=FAM&sectionNum=4055",
          "text": "(a) The statewide uniform guideline for determining child support orders is as follows: CS = K[HN - (H%)(TN)].\n\n(b) (1) The components of the formula are as follows:\n\n(A) CS = child support amount.\n\n(B) K = amount of both parents’ income to be allocated for child support as set forth in paragraph (3).\n\n(C) HN = high earner’s net monthly disposable income.\n\n(D) H% = approximate percentage of time that the high earner has or will have primary physical responsibility for the children compared to the other parent. In cases in which parents have different time-sharing arrangements for different children, H% equals the average of the approximate percentages of time the high earner parent spends with each child.\n\n(E) TN = total net monthly disposable income of both parties.\n\n(2) To compute net disposable income, see Section 4059.\n\n(3) K (amount of both parents’ income allocated for child support) equals one plus H% (if H% is less than or equal to 50 percent) or two minus H% (if H% is greater than 50 percent) times the following fraction:\n\nTotal Net Disposable Income Per Month\n\n0.165 + TN/82,857\n\n$2,901–5,000\n\n0.131 + TN/42,149\n\n$5,001–10,000\n\n$10,001–15,000\n\n0.10 + 1,499/TN\n\nOver $15,000\n\n0.12 + 1,200/TN\n\nFor example, if H% equals 20 percent and the total monthly net disposable income of the parents is $1,000, K = (1 + 0.20) × (0.165 + 1,000/82,857), or 0.21. If H% equals 80 percent and the total monthly net disposable income of the parents is $1,000, K = (2 - 0.80) × (0.165 + 1,000/82,857), or 0.21.\n\n(4) For more than one child, multiply CS by:\n\n10 children\n\n(5) If the amount calculated under the formula results in a positive number, the higher earner shall pay that amount to the lower earner. If the amount calculated under the formula results in a negative number, the lower earner shall pay the absolute value of that amount to the higher earner.\n\n(6) In any default proceeding where proof is by affidavit pursuant to Section 2336, or in any proceeding for child support in which a party fails to appear after being duly noticed, H% shall be set at zero in the formula if the noncustodial parent is the higher earner or at 100 if the custodial parent is the higher earner, where there is no evidence presented demonstrating the percentage of time that the noncustodial parent has primary physical responsibility for the children. H% shall not be set as described in paragraph (3) if the moving party in a default proceeding is the noncustodial parent or if the party who fails to appear after being duly noticed is the custodial parent. A statement by the party who is not in default as to the percentage of time that the noncustodial parent has primary physical responsibility for the children shall be deemed sufficient evidence.\n\n(7) In all cases in which the net disposable income per month of the obligor is less than the amount of monthly gross income earned from full-time minimum wage, established by Section 1182.12 of the Labor Code, at 40 hours per week, 52 weeks per year, there is a rebuttable presumption that the obligor is entitled to a low-income adjustment. The presumption may be rebutted by evidence showing that the application of the lowest amount of child support permitted pursuant to this paragraph would be unjust and inappropriate in the particular case. In determining whether the presumption is rebutted, the court shall consider the principles provided in Section 4053, and the impact of the contemplated adjustment on the respective net incomes of the obligor and the obligee. The low-income adjustment shall reduce the child support amount otherwise determined under this section by an amount that is no greater than the amount calculated by multiplying the child support amount otherwise determined under this section by a fraction, the numerator of which is the amount of monthly gross income earned from full-time minimum wage, established by Section 1182.12 of the Labor Code, at 40 hours per week, 52 weeks per year, minus the obligor’s net disposable income per month, and the denominator of which is the amount of monthly gross income earned from full-time minimum wage, established by Section 1182.12 of the Labor Code, at 40 hours per week, 52 weeks per year.\n\n(8) Unless the court orders otherwise, the order for child support shall allocate the support amount so that the amount of support for the youngest child is the amount of support for one child, and the amount for the next youngest child is the difference between that amount and the amount for two children, with similar allocations for additional children. However, this paragraph does not apply to cases in which there are different time-sharing arrangements for different children or where the court determines that the allocation would be inappropriate in the particular case.\n\n(c) If a court uses a computer to calculate the child support order and the obligor’s income qualifies for a low-income adjustment, the computer program shall provide the range of the adjust",
          "scraped": "2026-01-26T02:29:12.746Z",
          "title": "Child support calculation",
          "keywords": ["child support", "calculation", "guideline"]
        }
      ]
    },
    "VEH": {
      "name": "Vehicle Code",
      "sections": [
        {
          "code": "VEH",
          "section": "4000",
          "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=VEH&sectionNum=4000",
          "text": "(a) (1) A person shall not drive, move, or leave standing upon a highway, or in an offstreet public parking facility, any motor vehicle, trailer, semitrailer, pole or pipe dolly, or logging dolly, unless it is registered and the appropriate fees have been paid under this code or registered under the permanent trailer identification program, except that an off-highway motor vehicle which displays an identification plate or device issued by the department pursuant to Section 38010 may be driven, moved, or left standing in an offstreet public parking facility without being registered or paying registration fees.\n\n(2) For purposes of this subdivision, “offstreet public parking facility” means either of the following:\n\n(A) Any publicly owned parking facility.\n\n(B) Any privately owned parking facility for which no fee for the privilege to park is charged and which is held open for the common public use of retail customers.\n\n(3) This subdivision does not apply to any motor vehicle stored in a privately owned offstreet parking facility by, or with the express permission of, the owner of the privately owned offstreet parking facility.\n\n(4) (A) (i) A violation of this subdivision shall not be the sole basis for any enforcement action before the second month after the month of expiration of the vehicle’s registration.\n\n(ii) Notwithstanding clause (i), if a vehicle is stopped for any other violation of this code, enforcement action for a violation of this subdivision may be taken before the second month following the month of expiration.\n\n(B) This paragraph shall be operative from July 1, 2024, to January 1, 2030, inclusive.\n\n(b) A person shall not drive, move, or leave standing upon a highway any motor vehicle, as defined in Chapter 2 (commencing with Section 39010) of Part 1 of Division 26 of the Health and Safety Code, that has been registered in violation of Part 5 (commencing with Section 43000) of Division 26 of the Health and Safety Code.\n\n(c) Subdivisions (a) and (b) do not apply to off-highway motor vehicles operated pursuant to Sections 38025 and 38026.5.\n\n(d) This section does not apply, following payment of fees due for registration, during the time that registration and transfer is being withheld by the department pending the investigation of any use tax due under the Revenue and Taxation Code.\n\n(e) Subdivision (a) does not apply to a vehicle that is towed by a tow truck on the order of a sheriff, marshal, or other official acting pursuant to a court order or on the order of a peace officer acting pursuant to this code.\n\n(f) Subdivision (a) applies to a vehicle that is towed from a highway or offstreet parking facility under the direction of a highway service organization when that organization is providing emergency roadside assistance to that vehicle. However, the operator of a tow truck providing that assistance to that vehicle is not responsible for the violation of subdivision (a) with respect to that vehicle. The owner of an unregistered vehicle that is disabled and located on private property, shall obtain a permit from the department pursuant to Section 4003 prior to having the vehicle towed on the highway.\n\n(g) (1) Pursuant to Section 4022 and to subparagraph (B) of paragraph (3) of subdivision (o) of Section 22651, a vehicle obtained by a licensed repossessor as a release of collateral is exempt from registration pursuant to this section for purposes of the repossessor removing the vehicle to their storage facility or the facility of the legal owner. A law enforcement agency, impounding authority, tow yard, storage facility, or any other person in possession of the collateral shall release the vehicle without requiring current registration and pursuant to subdivision (f) of Section 14602.6.\n\n(2) The legal owner of collateral shall, by operation of law and without requiring further action, indemnify and hold harmless a law enforcement agency, city, county, city and county, the state, a tow yard, storage facility, or an impounding yard from a claim arising out of the release of the collateral to a licensee, and from any damage to the collateral after its release, including reasonable attorney’s fees and costs associated with defending a claim, if the collateral was released in compliance with this subdivision.\n\n(h) For purposes of this section, possession of a California driver’s license by the registered owner of a vehicle shall give rise to a rebuttable presumption that the owner is a resident of California.",
          "scraped": "2026-01-26T02:29:13.398Z",
          "title": "Vehicle registration required",
          "keywords": ["registration", "register", "dmv"]
        },
        {
          "code": "VEH",
          "section": "12500",
          "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=VEH&sectionNum=12500",
          "text": "(a) A person may not drive a motor vehicle upon a highway, unless the person then holds a valid driver’s license issued under this code, except those persons who are expressly exempted under this code.\n\n(b) A person may not drive a motorcycle, motor-driven cycle, or motorized bicycle upon a highway, unless the person then holds a valid driver’s license or endorsement issued under this code for that class, except those persons who are expressly exempted under this code, or those persons specifically authorized to operate motorized bicycles or motorized scooters with a valid driver’s license of any class, as specified in subdivision (h) of Section 12804.9.\n\n(c) A person may not drive a motor vehicle in or upon any offstreet parking facility, unless the person then holds a valid driver’s license of the appropriate class or certification to operate the vehicle. As used in this subdivision, “offstreet parking facility” means any offstreet facility held open for use by the public for parking vehicles and includes any publicly owned facilities for offstreet parking, and privately owned facilities for offstreet parking where no fee is charged for the privilege to park and which are held open for the common public use of retail customers.\n\n(d) A person may not drive a motor vehicle or combination of vehicles that is not of a type for which the person is licensed.\n\n(e) A motorized scooter operated on public streets shall at all times be equipped with an engine that complies with the applicable State Air Resources Board emission requirements.",
          "scraped": "2026-01-26T02:29:13.992Z",
          "title": "Driver license required",
          "keywords": ["license", "driving", "unlicensed"]
        },
        {
          "code": "VEH",
          "section": "14601",
          "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=VEH&sectionNum=14601",
          "text": "(a) No person shall drive a motor vehicle at any time when that person’s driving privilege is suspended or revoked for reckless driving in violation of Section 23103, 23104, or 23105, any reason listed in subdivision (a) or (c) of Section 12806 authorizing the department to refuse to issue a license, negligent or incompetent operation of a motor vehicle as prescribed in subdivision (e) of Section 12809, or negligent operation as prescribed in Section 12810.5, if the person so driving has knowledge of the suspension or revocation. Knowledge shall be conclusively presumed if mailed notice has been given by the department to the person pursuant to Section 13106. The presumption established by this subdivision is a presumption affecting the burden of proof.\n\n(b) A person convicted under this section shall be punished as follows:\n\n(1) Upon a first conviction, by imprisonment in a county jail for not less than five days or more than six months and by a fine of not less than three hundred dollars ($300) or more than one thousand dollars ($1,000).\n\n(2) If the offense occurred within five years of a prior offense that resulted in a conviction of a violation of this section or Section 14601.1, 14601.2, or 14601.5, by imprisonment in a county jail for not less than 10 days or more than one year and by a fine of not less than five hundred dollars ($500) or more than two thousand dollars ($2,000).\n\n(c) If the offense occurred within five years of a prior offense that resulted in a conviction of a violation of this section or Section 14601.1, 14601.2, or 14601.5, and is granted probation, the court shall impose as a condition of probation that the person be confined in a county jail for at least 10 days.\n\n(d) Nothing in this section prohibits a person from driving a motor vehicle, that is owned or utilized by the person’s employer, during the course of employment on private property that is owned or utilized by the employer, except an offstreet parking facility as defined in subdivision (c) of Section 12500.\n\n(e) When the prosecution agrees to a plea of guilty or nolo contendere to a charge of a violation of this section in satisfaction of, or as a substitute for, an original charge of a violation of Section 14601.2, and the court accepts that plea, except, in the interest of justice, when the court finds it would be inappropriate, the court shall, pursuant to Section 23575, require the person convicted, in addition to any other requirements, to install a certified ignition interlock device on any vehicle that the person owns or operates for a period not to exceed three years.\n\n(f) This section also applies to the operation of an off-highway motor vehicle on those lands to which the Chappie-Z’berg Off-Highway Motor Vehicle Law of 1971 (Division 16.5 (commencing with Section 38000)) applies as to off-highway motor vehicles, as described in Section 38001.",
          "scraped": "2026-01-26T02:29:14.595Z",
          "title": "Driving on suspended license",
          "keywords": ["suspended", "license", "driving"]
        },
        {
          "code": "VEH",
          "section": "22350",
          "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=VEH&sectionNum=22350",
          "text": "No person shall drive a vehicle upon a highway at a speed greater than is reasonable or prudent having due regard for weather, visibility, the traffic on, and the surface and width of, the highway, and in no event at a speed which endangers the safety of persons or property.",
          "scraped": "2026-01-26T02:29:15.183Z",
          "title": "Basic speed law",
          "keywords": ["speed", "speeding", "safe"]
        },
        {
          "code": "VEH",
          "section": "23152",
          "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=VEH&sectionNum=23152",
          "text": "(a) It is unlawful for a person who is under the influence of any alcoholic beverage to drive a vehicle.\n\n(b) It is unlawful for a person who has 0.08 percent or more, by weight, of alcohol in his or her blood to drive a vehicle.\n\nFor purposes of this article and Section 34501.16, percent, by weight, of alcohol in a person’s blood is based upon grams of alcohol per 100 milliliters of blood or grams of alcohol per 210 liters of breath.\n\nIn any prosecution under this subdivision, it is a rebuttable presumption that the person had 0.08 percent or more, by weight, of alcohol in his or her blood at the time of driving the vehicle if the person had 0.08 percent or more, by weight, of alcohol in his or her blood at the time of the performance of a chemical test within three hours after the driving.\n\n(c) It is unlawful for a person who is addicted to the use of any drug to drive a vehicle. This subdivision shall not apply to a person who is participating in a narcotic treatment program approved pursuant to Article 3 (commencing with Section 11875) of Chapter 1 of Part 3 of Division 10.5 of the Health and Safety Code.\n\n(d) It is unlawful for a person who has 0.04 percent or more, by weight, of alcohol in his or her blood to drive a commercial motor vehicle, as defined in Section 15210. In a prosecution under this subdivision, it is a rebuttable presumption that the person had 0.04 percent or more, by weight, of alcohol in his or her blood at the time of driving the vehicle if the person had 0.04 percent or more, by weight, of alcohol in his or her blood at the time of the performance of a chemical test within three hours after the driving.\n\n(e) Commencing July 1, 2018, it shall be unlawful for a person who has 0.04 percent or more, by weight, of alcohol in his or her blood to drive a motor vehicle when a passenger for hire is a passenger in the vehicle at the time of the offense. For purposes of this subdivision, “passenger for hire” means a passenger for whom consideration is contributed or expected as a condition of carriage in the vehicle, whether directly or indirectly flowing to the owner, operator, agent, or any other person having an interest in the vehicle. In a prosecution under this subdivision, it is a rebuttable presumption that the person had 0.04 percent or more, by weight, of alcohol in his or her blood at the time of driving the vehicle if the person had 0.04 percent or more, by weight, of alcohol in his or her blood at the time of the performance of a chemical test within three hours after the driving.\n\n(f) It is unlawful for a person who is under the influence of any drug to drive a vehicle.\n\n(g) It is unlawful for a person who is under the combined influence of any alcoholic beverage and drug to drive a vehicle.",
          "scraped": "2026-01-26T02:29:15.782Z",
          "title": "DUI definition",
          "keywords": ["dui", "drunk driving", "alcohol"]
        }
      ]
    },
    "UIC": {
      "name": "Unemployment Insurance Code",
      "sections": [
        {
          "code": "UIC",
          "section": "1253",
          "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=UIC&sectionNum=1253",
          "text": "An unemployed individual is eligible to receive unemployment compensation benefits with respect to any week only if the director finds that:\n\n(a) A claim for benefits with respect to that week has been made in accordance with authorized regulations.\n\n(b) He or she has registered for work, and thereafter continued to report, at a public employment office or any other place as the director may approve. Either or both of the requirements of this subdivision may be waived or altered by authorized regulation as to partially employed individuals attached to regular jobs.\n\n(c) He or she was able to work and available for work for that week.\n\n(d) He has been unemployed for a waiting period of one week as defined in Section 1254, unless this waiting period has been waived pursuant to Section 8571 of the Government Code.\n\n(e) He or she conducted a search for suitable work in accordance with specific and reasonable instructions of a public employment office.\n\n(f) He or she participated as required by the director in reemployment activities, such as orientation and assessment if the individual has been identified pursuant to an automated profiling system as likely to exhaust regular unemployment benefits unless the individual has shown good cause for failure to participate.",
          "scraped": "2026-01-26T02:29:16.383Z",
          "title": "Eligibility for benefits",
          "keywords": ["unemployment", "eligible", "qualify"]
        },
        {
          "code": "UIC",
          "section": "1256",
          "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=UIC&sectionNum=1256",
          "text": "An individual is disqualified for unemployment compensation benefits if the director finds that he or she left his or her most recent work voluntarily without good cause or that he or she has been discharged for misconduct connected with his or her most recent work.\n\nAn individual is presumed to have been discharged for reasons other than misconduct in connection with his or her work and not to have voluntarily left his or her work without good cause unless his or her employer has given written notice to the contrary to the department as provided in Section 1327, setting forth facts sufficient to overcome the presumption. The presumption provided by this section is rebuttable.\n\nAn individual whose employment is terminated under the compulsory retirement provisions of a collective bargaining agreement to which the employer is a party, shall not be deemed to have left his or her work without good cause.\n\nAn individual may be deemed to have left his or her most recent work with good cause if he or she leaves employment to accompany his or her spouse or domestic partner to a place or to join him or her at a place from which it is impractical to commute to the employment. For purposes of this section “spouse” includes a person to whom marriage is imminent, and “domestic partner” includes a person to whom a domestic partnership, as described in Section 297 of the Family Code, is imminent.\n\nAn individual may be deemed to have left his or her most recent work with good cause if he or she leaves employment to protect his or her family, or himself or herself, from domestic violence abuse.\n\nAn individual shall be deemed to have left his or her most recent work with good cause if he or she elects to be laid off in place of an employee with less seniority pursuant to a provision in a collective bargaining agreement that provides that an employee with more seniority may elect to be laid off in place of an employee with less seniority when the employer has decided to lay off employees.",
          "scraped": "2026-01-26T02:29:16.982Z",
          "title": "Disqualification - quit",
          "keywords": ["quit", "voluntary", "disqualified"]
        },
        {
          "code": "UIC",
          "section": "1257",
          "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=UIC&sectionNum=1257",
          "text": "An individual is also disqualified for unemployment compensation benefits if:\n\n(a) He or she willfully, for the purpose of obtaining unemployment compensation benefits, either made a false statement or representation, including, but not limited to, using a false name, false social security number, or other false identification, with actual knowledge of the falsity thereof, or withheld a material fact in order to obtain any unemployment compensation benefits under this division.\n\n(b) He or she, without good cause, refused to accept suitable employment when offered to him or her, or failed to apply for suitable employment when notified by a public employment office.",
          "scraped": "2026-01-26T02:29:17.580Z",
          "title": "Disqualification - misconduct",
          "keywords": ["fired", "misconduct", "disqualified"]
        },
        {
          "code": "UIC",
          "section": "2601",
          "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=UIC&sectionNum=2601",
          "text": "The purpose of this part is to compensate in part for the wage loss sustained by any individual who is unable to work due to the employee’s own sickness or injury, the sickness or injury of a family member, or the birth, adoption, or foster care placement of a new child, and to reduce to a minimum the suffering caused by unemployment resulting therefrom. This part shall be construed liberally in aid of its declared purpose to mitigate the evils and burdens that fall on the unemployed worker and his or her family.",
          "scraped": "2026-01-26T02:29:18.177Z",
          "title": "Disability insurance",
          "keywords": ["disability", "sdi", "benefits"]
        }
      ]
    },
    "WIC": {
      "name": "Welfare and Institutions Code",
      "sections": [
        {
          "code": "WIC",
          "section": "11250",
          "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=WIC&sectionNum=11250",
          "text": "Aid, services, or both shall be granted under the provisions of this chapter, and subject to the regulations of the department, to families with related children under the age of 18 years, except as provided in Section 11253, in need thereof because they have been deprived of parental support or care due to:\n\n(a) The death, physical or mental incapacity, or incarceration of a parent.\n\n(b) The unemployment of a parent or parents.\n\n(c) Continued absence of a parent from the home due to divorce, separation, desertion, or any other reason, except absence occasioned solely by reason of the performance of active duty in the uniformed services of the United States. “Continued absence” exists when the nature of the absence is such as either to interrupt or to terminate the parent’s functioning as a provider of maintenance, physical care, or guidance for the child, and the known or indefinite duration of the absence precludes counting on the parent’s performance of the function of planning for the present support or care of the child. If these conditions exist, the parent may be absent for any reason, and may have left only recently or some time previously.",
          "scraped": "2026-01-26T02:29:19.460Z",
          "title": "CalWORKs eligibility",
          "keywords": ["calworks", "tanf", "cash aid"]
        },
        {
          "code": "WIC",
          "section": "18901",
          "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=WIC&sectionNum=18901",
          "text": "(a) The eligibility of households shall be determined to the extent permitted by federal law.\n\n(b) In determining eligibility for CalFresh, minimum age requirements other than those that exist under federal law shall not be imposed.\n\n(c) The department shall establish verification policies and procedures for CalFresh applicants and beneficiaries in the event that necessary verification is not provided by the applicant or beneficiary to accompany the application, semiannual report, annual recertification, or any other form or submission that requests verification be provided at the time of submission. These policies and procedures, to the extent permitted by federal law, regulation, guidance, or a waiver thereof, shall require counties to first seek verification from available electronic sources or self-attestation before requesting documentary evidence from the applicant or beneficiary to complete required verification or pursuing secondary evidence to verify the necessary information. Notwithstanding the rulemaking provisions of the Administrative Procedure Act (Chapter 3.5 (commencing with Section 11340) of Part 1 of Division 3 of Title 2 of the Government Code), the department shall issue an all-county letter or similar instructions no later than January 1, 2021.",
          "scraped": "2026-01-26T02:29:20.775Z",
          "title": "CalFresh (food stamps)",
          "keywords": ["calfresh", "food stamps", "snap"]
        }
      ]
    }
  },
  "sections": [
    {
      "code": "CIV",
      "section": "1940",
      "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=CIV&sectionNum=1940",
      "text": "(a) Except as provided in subdivision (b), this chapter shall apply to all persons who hire dwelling units located within this state including tenants, lessees, boarders, lodgers, and others, however denominated.\n\n(b) The term “persons who hire” shall not include a person who maintains either of the following:\n\n(1) Transient occupancy in a hotel, motel, residence club, or other facility when the transient occupancy is or would be subject to tax under Section 7280 of the Revenue and Taxation Code. The term “persons who hire” shall not include a person to whom this paragraph pertains if the person has not made valid payment for all room and other related charges owing as of the last day on which his or her occupancy is or would be subject to tax under Section 7280 of the Revenue and Taxation Code.\n\n(2) Occupancy at a hotel or motel where the innkeeper retains a right of access to and control of the dwelling unit and the hotel or motel provides or offers all of the following services to all of the residents:\n\n(A) Facilities for the safeguarding of personal property pursuant to Section 1860.\n\n(B) Central telephone service subject to tariffs covering the same filed with the California Public Utilities Commission.\n\n(C) Maid, mail, and room services.\n\n(D) Occupancy for periods of less than seven days.\n\n(E) Food service provided by a food establishment, as defined in Section 113780 of the Health and Safety Code, located on or adjacent to the premises of the hotel or motel and owned or operated by the innkeeper or owned or operated by a person or entity pursuant to a lease or similar relationship with the innkeeper or person or entity affiliated with the innkeeper.\n\n(c) “Dwelling unit” means a structure or the part of a structure that is used as a home, residence, or sleeping place by one person who maintains a household or by two or more persons who maintain a common household.\n\n(d) Nothing in this section shall be construed to limit the application of any provision of this chapter to tenancy in a dwelling unit unless the provision is so limited by its specific terms.",
      "scraped": "2026-01-26T02:28:56.348Z",
      "title": "Application of tenant law",
      "keywords": ["tenant", "rental", "lease"]
    },
    {
      "code": "CIV",
      "section": "1940.2",
      "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=CIV&sectionNum=1940.2",
      "text": "(a) It is unlawful for a landlord to do any of the following for the purpose of influencing a tenant to vacate a dwelling:\n\n(1) Engage in conduct that violates subdivision (a) of Section 484 of the Penal Code.\n\n(2) Engage in conduct that violates Section 518 of the Penal Code.\n\n(3) Use, or threaten to use, force, willful threats, or menacing conduct constituting a course of conduct that interferes with the tenant’s quiet enjoyment of the premises in violation of Section 1927 that would create an apprehension of harm in a reasonable person. Nothing in this paragraph requires a tenant to be actually or constructively evicted in order to obtain relief.\n\n(4) Commit a significant and intentional violation of Section 1954.\n\n(5) Threaten to disclose information regarding or relating to the immigration or citizenship status of a tenant, occupant, or other person known to the landlord to be associated with a tenant or occupant. This paragraph does not require a tenant to be actually or constructively evicted in order to obtain relief.\n\n(b) A tenant who prevails in a civil action, including an action in small claims court, to enforce his or her rights under this section is entitled to a civil penalty in an amount not to exceed two thousand dollars ($2,000) for each violation.\n\n(c) An oral or written warning notice, given in good faith, regarding conduct by a tenant, occupant, or guest that violates, may violate, or violated the applicable rental agreement, rules, regulations, lease, or laws, is not a violation of this section. An oral or written explanation of the rental agreement, rules, regulations, lease, or laws given in the normal course of business is not a violation of this section.\n\n(d) This section does not enlarge or diminish a landlord’s right to terminate a tenancy pursuant to existing state or local law; nor does this section enlarge or diminish any ability of local government to regulate or enforce a prohibition against a landlord’s harassment of a tenant.",
      "scraped": "2026-01-26T02:28:56.964Z",
      "title": "Landlord entry requirements",
      "keywords": ["landlord entry", "notice", "privacy"]
    },
    {
      "code": "CIV",
      "section": "1941",
      "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=CIV&sectionNum=1941",
      "text": "Section Nineteen Hundred and Forty-one. The lessor of a building intended for the occupation of human beings must, in the absence of an agreement to the contrary, put it into a condition fit for such occupation, and repair all subsequent dilapidations thereof, which render it untenantable, except such as are mentioned in section nineteen hundred and twenty-nine.",
      "scraped": "2026-01-26T02:28:57.581Z",
      "title": "Habitability requirements",
      "keywords": ["habitability", "repairs", "livable"]
    },
    {
      "code": "CIV",
      "section": "1941.1",
      "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=CIV&sectionNum=1941.1",
      "text": "(a) A dwelling shall be deemed untenantable for purposes of Section 1941 if it substantially lacks any of the following affirmative standard characteristics or is a residential unit described in Section 17920.3 or 17920.10 of the Health and Safety Code:\n\n(1) Effective waterproofing and weather protection of roof and exterior walls, including unbroken windows and doors.\n\n(2) Plumbing or gas facilities that conformed to applicable law in effect at the time of installation, maintained in good working order.\n\n(3) A water supply approved under applicable law that is under the control of the tenant, capable of producing hot and cold running water, or a system that is under the control of the landlord, that produces hot and cold running water, furnished to appropriate fixtures, and connected to a sewage disposal system approved under applicable law.\n\n(4) Heating facilities that conformed with applicable law at the time of installation, maintained in good working order.\n\n(5) Electrical lighting, with wiring and electrical equipment that conformed with applicable law at the time of installation, maintained in good working order.\n\n(6) Building, grounds, and appurtenances at the time of the commencement of the lease or rental agreement, and all areas under control of the landlord, kept in every part clean, sanitary, and free from all accumulations of debris, filth, rubbish, garbage, rodents, and vermin.\n\n(7) An adequate number of appropriate receptacles for garbage and rubbish, in clean condition and good repair at the time of the commencement of the lease or rental agreement, with the landlord providing appropriate serviceable receptacles thereafter and being responsible for the clean condition and good repair of the receptacles under their control.\n\n(8) Floors, stairways, and railings maintained in good repair.\n\n(9) A locking mail receptacle for each residential unit in a residential hotel, as required by Section 17958.3 of the Health and Safety Code. This subdivision shall become operative on July 1, 2008.\n\n(10) Except as provided in subdivision (b), a stove that is maintained in good working order and capable of safely generating heat for cooking purposes. A stove that is subject to a recall by the manufacturer or a public entity is not capable of safely generating heat for cooking purposes. This paragraph shall only apply to a lease entered into, amended, or extended on or after January 1, 2026.\n\n(11) (A) Except as provided in subdivision (b) and subparagraph (B), a refrigerator that is maintained in good working order and capable of safely storing food. A refrigerator that is subject to recall by the manufacturer or a public entity is not capable of safely storing food.\n\n(B) A tenant and landlord may mutually agree when the lease is signed if the tenant chooses to provide and maintain their own refrigerator, provided that all of the following apply:\n\n(i) The lease contains a statement in substantially the following form:\n\n“Under state law, the landlord is required to provide a refrigerator in good working order in your unit. By checking this box, you acknowledge that you have asked to bring your own refrigerator and that you are responsible for keeping that refrigerator in working order.”\n\n(ii) The lease provides that the tenant may, with 30 days written notice, inform the landlord that they no longer wish to keep their own refrigerator in the unit, and that at the end of the 30-day notice period, the landlord shall install a refrigerator in good working order in the unit.\n\n(iii) A landlord shall not condition a tenancy upon the tenant providing their own refrigerator.\n\n(iv) The landlord shall not be responsible for the maintenance of a refrigerator provided by the tenant.\n\n(C) This paragraph shall only apply to a lease entered into, amended, or extended on or after January 1, 2026.\n\n(b) The characteristics described in paragraphs (10) and (11) of subdivision (a) shall not apply to any of the following:\n\n(1) Permanent supportive housing, as that term is defined in paragraph (2) of subdivision (c) of Section 8698.4 of the Government Code.\n\n(2) A single-room occupancy unit that provides living and sleeping space for the exclusive use of the occupant, including those in which occupants share food preparation facilities with occupants.\n\n(3) A unit in a residential hotel, as that term is defined in paragraph (1) of subdivision (b) of Section 50519 of the Health and Safety Code.\n\n(4) A dwelling unit within a housing facility that offers shared or communal kitchen spaces to its residents, including a dwelling unit within an assisted living facility.\n\n(c) (1) A landlord shall repair or replace a stove or refrigerator that is subject to recall by the manufacturer or a public entity, as described in paragraphs (10) and (11) of subdivision (a), within 30 days of receiving notice that the stove or refrigerator is subject to recall.\n\n(2) Nothing in this subdivision shall be construed to prohibit a tenant from exercising any ",
      "scraped": "2026-01-26T02:28:58.196Z",
      "title": "Untenantable dwelling conditions",
      "keywords": ["uninhabitable", "conditions", "repairs"]
    },
    {
      "code": "CIV",
      "section": "1942",
      "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=CIV&sectionNum=1942",
      "text": "(a) If within a reasonable time after written or oral notice to the landlord or his agent, as defined in subdivision (a) of Section 1962, of dilapidations rendering the premises untenantable which the landlord ought to repair, the landlord neglects to do so, the tenant may repair the same himself where the cost of such repairs does not require an expenditure more than one month’s rent of the premises and deduct the expenses of such repairs from the rent when due, or the tenant may vacate the premises, in which case the tenant shall be discharged from further payment of rent, or performance of other conditions as of the date of vacating the premises. This remedy shall not be available to the tenant more than twice in any 12-month period.\n\n(b) For the purposes of this section, if a tenant acts to repair and deduct after the 30th day following notice, he is presumed to have acted after a reasonable time. The presumption established by this subdivision is a rebuttable presumption affecting the burden of producing evidence and shall not be construed to prevent a tenant from repairing and deducting after a shorter notice if all the circumstances require shorter notice.\n\n(c) The tenant’s remedy under subdivision (a) shall not be available if the condition was caused by the violation of Section 1929 or 1941.2.\n\n(d) The remedy provided by this section is in addition to any other remedy provided by this chapter, the rental agreement, or other applicable statutory or common law.",
      "scraped": "2026-01-26T02:28:58.818Z",
      "title": "Tenant remedy for breach",
      "keywords": ["repair", "deduct", "remedy"]
    },
    {
      "code": "CIV",
      "section": "1942.4",
      "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=CIV&sectionNum=1942.4",
      "text": "(a) A landlord of a dwelling may not demand rent, collect rent, issue a notice of a rent increase, or issue a three-day notice to pay rent or quit pursuant to subdivision (2) of Section 1161 of the Code of Civil Procedure, if all of the following conditions exist prior to the landlord’s demand or notice:\n\n(1) The dwelling substantially lacks any of the affirmative standard characteristics listed in Section 1941.1 or violates Section 17920.10 of the Health and Safety Code, or is deemed and declared substandard as set forth in Section 17920.3 of the Health and Safety Code because conditions listed in that section exist to an extent that endangers the life, limb, health, property, safety, or welfare of the public or the occupants of the dwelling.\n\n(2) A public officer or employee who is responsible for the enforcement of any housing law, after inspecting the premises, has notified the landlord or the landlord’s agent in writing of his or her obligations to abate the nuisance or repair the substandard conditions.\n\n(3) The conditions have existed and have not been abated 35 days beyond the date of service of the notice specified in paragraph (2) and the delay is without good cause. For purposes of this subdivision, service shall be complete at the time of deposit in the United States mail.\n\n(4) The conditions were not caused by an act or omission of the tenant or lessee in violation of Section 1929 or 1941.2.\n\n(b) (1) A landlord who violates this section is liable to the tenant or lessee for the actual damages sustained by the tenant or lessee and special damages of not less than one hundred dollars ($100) and not more than five thousand dollars ($5,000).\n\n(2) The prevailing party shall be entitled to recovery of reasonable attorney’s fees and costs of the suit in an amount fixed by the court.\n\n(c) Any court that awards damages under this section may also order the landlord to abate any nuisance at the rental dwelling and to repair any substandard conditions of the rental dwelling, as defined in Section 1941.1, which significantly or materially affect the health or safety of the occupants of the rental dwelling and are uncorrected. If the court orders repairs or corrections, or both, the court’s jurisdiction continues over the matter for the purpose of ensuring compliance.\n\n(d) The tenant or lessee shall be under no obligation to undertake any other remedy prior to exercising his or her rights under this section.\n\n(e) Any action under this section may be maintained in small claims court if the claim does not exceed the jurisdictional limit of that court.\n\n(f) The remedy provided by this section may be utilized in addition to any other remedy provided by this chapter, the rental agreement, lease, or other applicable statutory or common law. Nothing in this section shall require any landlord to comply with this section if he or she pursues his or her rights pursuant to Chapter 12.75 (commencing with Section 7060) of Division 7 of Title 1 of the Government Code.",
      "scraped": "2026-01-26T02:28:59.430Z",
      "title": "Rent withholding for violations",
      "keywords": ["rent withhold", "habitability"]
    },
    {
      "code": "CIV",
      "section": "1942.5",
      "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=CIV&sectionNum=1942.5",
      "text": "(a) If the lessor retaliates against the lessee because of the exercise by the lessee of the lessee’s rights under this chapter or because of the lessee’s complaint to an appropriate agency as to tenantability of a dwelling, and if the lessee of a dwelling is not in default as to the payment of rent, the lessor may not recover possession of a dwelling in any action or proceeding, cause the lessee to quit involuntarily, increase the rent, or decrease any services within 180 days of any of the following:\n\n(1) After the date upon which the lessee, in good faith, has given notice pursuant to Section 1942, has provided notice of a suspected bed bug infestation, or has made an oral complaint to the lessor regarding tenantability.\n\n(2) After the date upon which the lessee, in good faith, has filed a written complaint, or an oral complaint which is registered or otherwise recorded in writing, with an appropriate agency, of which the lessor has notice, for the purpose of obtaining correction of a condition relating to tenantability.\n\n(3) After the date of an inspection or issuance of a citation, resulting from a complaint described in paragraph (2) of which the lessor did not have notice.\n\n(4) After the filing of appropriate documents commencing a judicial or arbitration proceeding involving the issue of tenantability.\n\n(5) After entry of judgment or the signing of an arbitration award, if any, when in the judicial proceeding or arbitration the issue of tenantability is determined adversely to the lessor.\n\nIn each instance, the 180-day period shall run from the latest applicable date referred to in paragraphs (1) to (5), inclusive.\n\n(b) A lessee may not invoke subdivision (a) more than once in any 12-month period.\n\n(c) To report, or to threaten to report, the lessee or individuals known to the landlord to be associated with the lessee to immigration authorities is a form of retaliatory conduct prohibited under subdivision (a). This subdivision shall in no way limit the definition of retaliatory conduct prohibited under this section.\n\n(d) Notwithstanding subdivision (a), it is unlawful for a lessor to increase rent, decrease services, cause a lessee to quit involuntarily, bring an action to recover possession, or threaten to do any of those acts, for the purpose of retaliating against the lessee because the lessee has lawfully organized or participated in a lessees’ association or an organization advocating lessees’ rights or has lawfully and peaceably exercised any rights under the law. In an action brought by or against the lessee pursuant to this subdivision, the lessee shall bear the burden of producing evidence that the lessor’s conduct was, in fact, retaliatory.\n\n(e) To report, or to threaten to report, the lessee or individuals known to the landlord to be associated with the lessee to immigration authorities is a form of retaliatory conduct prohibited under subdivision (d). This subdivision shall in no way limit the definition of retaliatory conduct prohibited under this section.\n\n(f) This section does not limit in any way the exercise by the lessor of the lessor’s rights under any lease or agreement or any law pertaining to the hiring of property or the lessor’s right to do any of the acts described in subdivision (a) or (d) for any lawful cause. Any waiver by a lessee of the lessee’s rights under this section is void as contrary to public policy.\n\n(g) Notwithstanding subdivisions (a) to (f), inclusive, a lessor may recover possession of a dwelling and do any of the other acts described in subdivision (a) within the period or periods prescribed therein, or within subdivision (d), if the notice of termination, rent increase, or other act, and any pleading or statement of issues in an arbitration, if any, states the ground upon which the lessor, in good faith, seeks to recover possession, increase rent, or do any of the other acts described in subdivision (a) or (d). If the statement is controverted, the lessor shall establish its truth at the trial or other hearing.\n\n(h) Any lessor or agent of a lessor who violates this section shall be liable to the lessee in a civil action for all of the following:\n\n(1) The actual damages sustained by the lessee.\n\n(2) Punitive damages in an amount of not less than one hundred dollars ($100) nor more than two thousand dollars ($2,000) for each retaliatory act where the lessor or agent has been guilty of fraud, oppression, or malice with respect to that act.\n\n(i) In any action brought for damages for retaliatory eviction, the court shall award reasonable attorney’s fees to the prevailing party if either party requests attorney’s fees upon the initiation of the action.\n\n(j) The remedies provided by this section shall be in addition to any other remedies provided by statutory or decisional law.\n\n(k) A lessor does not violate subdivision (c) or (e) by complying with any legal obligation under any federal government program that provides for rent limitations or rental assistance t",
      "scraped": "2026-01-26T02:29:00.042Z",
      "title": "Retaliation prohibited",
      "keywords": ["retaliation", "eviction", "complaint"]
    },
    {
      "code": "CIV",
      "section": "1946",
      "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=CIV&sectionNum=1946",
      "text": "(a) A hiring of real property, for a term not specified by the parties, is deemed to be renewed as stated in Section 1945, at the end of the term implied by law unless one of the parties gives written notice to the other of that party’s intention to terminate the same, at least as long before the expiration thereof as the term of the hiring itself, not exceeding 30 days; provided, however, that as to tenancies from month to month either of the parties may terminate the same by giving at least 30 days’ written notice thereof at any time and the rent shall be due and payable to and including the date of termination. It shall be competent for the parties to provide by an agreement at the time the tenancy is created that a notice of the intention to terminate the same may be given at any time not less than seven days before the expiration of the term thereof. The notice herein required shall be given in the manner prescribed in Section 1162 of the Code of Civil Procedure or by sending a copy by certified or registered mail addressed to the other party. In addition, the lessee may give the notice by sending a copy by certified or registered mail addressed to the agent of the lessor to whom the lessee has paid the rent for the month prior to the date of the notice or by delivering a copy to the agent personally. The notice given by the lessor shall also contain, in substantially the same form, the following:\n\n“State law permits former tenants to reclaim abandoned personal property left at the former address of the tenant, subject to certain conditions. You may or may not be able to reclaim property without incurring additional costs, depending on the cost of storing the property and the length of time before it is reclaimed. In general, these costs will be lower the sooner you contact your former landlord after being notified that property belonging to you was left behind after you moved out.”\n\n(b) A landlord or its agent shall not charge a tenant a fee for serving, posting, or otherwise delivering any notice, as described in this section.",
      "scraped": "2026-01-26T02:29:00.658Z",
      "title": "Notice to terminate tenancy",
      "keywords": ["notice", "terminate", "end lease"]
    },
    {
      "code": "CIV",
      "section": "1946.2",
      "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=CIV&sectionNum=1946.2",
      "text": "(a) Notwithstanding any other law, after a tenant has continuously and lawfully occupied a residential real property for 12 months, the owner of the residential real property shall not terminate a tenancy without just cause, which shall be stated in the written notice to terminate tenancy. If any additional adult tenants are added to the lease before an existing tenant has continuously and lawfully occupied the residential real property for 24 months, then this subdivision shall only apply if either of the following are satisfied:\n\n(1) All of the tenants have continuously and lawfully occupied the residential real property for 12 months or more.\n\n(2) One or more tenants have continuously and lawfully occupied the residential real property for 24 months or more.\n\n(b) For purposes of this section, “just cause” means either of the following:\n\n(1) At-fault just cause, which means any of the following:\n\n(A) Default in the payment of rent.\n\n(B) A breach of a material term of the lease, as described in paragraph (3) of Section 1161 of the Code of Civil Procedure, including, but not limited to, violation of a provision of the lease after being issued a written notice to correct the violation.\n\n(C) Maintaining, committing, or permitting the maintenance or commission of a nuisance as described in paragraph (4) of Section 1161 of the Code of Civil Procedure.\n\n(D) Committing waste as described in paragraph (4) of Section 1161 of the Code of Civil Procedure.\n\n(E) The tenant had a written lease that terminated on or after January 1, 2020, or January 1, 2022, if the lease is for a tenancy in a mobilehome, and after a written request or demand from the owner, the tenant has refused to execute a written extension or renewal of the lease for an additional term of similar duration with similar provisions, provided that those terms do not violate this section or any other provision of law.\n\n(F) Criminal activity by the tenant on the residential real property, including any common areas, or any criminal activity or criminal threat, as defined in subdivision (a) of Section 422 of the Penal Code, on or off the residential real property, that is directed at any owner or agent of the owner of the residential real property.\n\n(G) Assigning or subletting the premises in violation of the tenant’s lease, as described in paragraph (4) of Section 1161 of the Code of Civil Procedure.\n\n(H) The tenant’s refusal to allow the owner to enter the residential real property as authorized by Sections 1101.5 and 1954 of this code, and Sections 13113.7 and 17926.1 of the Health and Safety Code.\n\n(I) Using the premises for an unlawful purpose as described in paragraph (4) of Section 1161 of the Code of Civil Procedure.\n\n(J) The employee, agent, or licensee’s failure to vacate after their termination as an employee, agent, or a licensee as described in paragraph (1) of Section 1161 of the Code of Civil Procedure.\n\n(K) When the tenant fails to deliver possession of the residential real property after providing the owner written notice as provided in Section 1946 of the tenant’s intention to terminate the hiring of the real property, or makes a written offer to surrender that is accepted in writing by the owner, but fails to deliver possession at the time specified in that written notice as described in paragraph (5) of Section 1161 of the Code of Civil Procedure.\n\n(2) No-fault just cause, which means any of the following:\n\n(A) (i) Intent to occupy the residential real property by the owner or the owner’s spouse, domestic partner, children, grandchildren, parents, or grandparents for a minimum of 12 continuous months as that person’s primary residence.\n\n(ii) For leases entered into on or after July 1, 2020, or July 1, 2022, if the lease is for a tenancy in a mobilehome, clause (i) shall apply only if the tenant agrees, in writing, to the termination, or if a provision of the lease allows the owner to terminate the lease if the owner, or the owner’s spouse, domestic partner, children, grandchildren, parents, or grandparents, unilaterally decides to occupy the residential real property. Addition of a provision allowing the owner to terminate the lease as described in this clause to a new or renewed rental agreement or fixed-term lease constitutes a similar provision for the purposes of subparagraph (E) of paragraph (1).\n\n(iii) This subparagraph does not apply if the intended occupant occupies a rental unit on the property or if a vacancy of a similar unit already exists at the property.\n\n(iv) The written notice terminating a tenancy for a just cause pursuant to this subparagraph shall contain the name or names and relationship to the owner of the intended occupant. The written notice shall additionally include notification that the tenant may request proof that the intended occupant is an owner or related to the owner as defined in subclause (II) of clause (viii). The proof shall be provided upon request and may include an operating agreement and other non",
      "scraped": "2026-01-26T02:29:01.283Z",
      "title": "Just cause eviction",
      "keywords": ["just cause", "eviction", "AB 1482"]
    },
    {
      "code": "CIV",
      "section": "1947.12",
      "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=CIV&sectionNum=1947.12",
      "text": "(a) (1) Subject to subdivision (b), an owner of residential real property shall not, over the course of any 12-month period, increase the gross rental rate for a dwelling or a unit more than 5 percent plus the percentage change in the cost of living, or 10 percent, whichever is lower, of the lowest gross rental rate charged for that dwelling or unit at any time during the 12 months prior to the effective date of the increase. In determining the lowest gross rental amount pursuant to this section, any rent discounts, incentives, concessions, or credits offered by the owner of such unit of residential real property and accepted by the tenant shall be excluded. The gross per-month rental rate and any owner-offered discounts, incentives, concessions, or credits shall be separately listed and identified in the lease or rental agreement or any amendments to an existing lease or rental agreement.\n\n(2) If the same tenant remains in occupancy of a unit of residential real property over any 12-month period, the gross rental rate for the unit of residential real property shall not be increased in more than two increments over that 12-month period, subject to the other restrictions of this subdivision governing gross rental rate increase.\n\n(b) For a new tenancy in which no tenant from the prior tenancy remains in lawful possession of the residential real property, the owner may establish the initial rental rate not subject to subdivision (a). Subdivision (a) is only applicable to subsequent increases after that initial rental rate has been established.\n\n(c) A tenant of residential real property subject to this section shall not enter into a sublease that results in a total rent for the premises that exceeds the allowable rental rate authorized by subdivision (a). Nothing in this subdivision authorizes a tenant to sublet or assign the tenant’s interest where otherwise prohibited.\n\n(d) This section shall not apply to the following residential real properties:\n\n(1) Housing restricted by deed, regulatory restriction contained in an agreement with a government agency, or other recorded document as affordable housing for persons and families of very low, low, or moderate income, as defined in Section 50093 of the Health and Safety Code, or subject to an agreement that provides housing subsidies for affordable housing for persons and families of very low, low, or moderate income, as defined in Section 50093 of the Health and Safety Code or comparable federal statutes.\n\n(2) Dormitories owned and operated by an institution of higher education or a kindergarten and grades 1 to 12, inclusive, school.\n\n(3) Housing subject to rent or price control through a public entity’s valid exercise of its police power consistent with Chapter 2.7 (commencing with Section 1954.50) that restricts annual increases in the rental rate to an amount less than that provided in subdivision (a).\n\n(4) Housing that has been issued a certificate of occupancy within the previous 15 years, unless the housing is a mobilehome.\n\n(5) Residential real property that is alienable separate from the title to any other dwelling unit, including a mobilehome, provided that both of the following apply:\n\n(A) The owner is not any of the following:\n\n(i) A real estate investment trust, as defined in Section 856 of the Internal Revenue Code.\n\n(ii) A corporation.\n\n(iii) A limited liability company in which at least one member is a corporation.\n\n(iv) Management of a mobilehome park, as defined in Section 798.2.\n\n(B) (i) The tenants have been provided written notice that the residential real property is exempt from this section using the following statement:\n\n“This property is not subject to the rent limits imposed by Section 1947.12 of the Civil Code and is not subject to the just cause requirements of Section 1946.2 of the Civil Code. This property meets the requirements of Sections 1947.12 (d)(5) and 1946.2 (e)(8) of the Civil Code and the owner is not any of the following: (1) a real estate investment trust, as defined by Section 856 of the Internal Revenue Code; (2) a corporation; or (3) a limited liability company in which at least one member is a corporation.”\n\n(ii) For a tenancy existing before July 1, 2020, or July 1, 2022, if the lease is for a tenancy in a mobilehome, the notice required under clause (i) may, but is not required to, be provided in the rental agreement.\n\n(iii) For a tenancy commenced or renewed on or after July 1, 2020, or July 1, 2022, if the lease is for a tenancy in a mobilehome, the notice required under clause (i) must be provided in the rental agreement.\n\n(iv) Addition of a provision containing the notice required under clause (i) to any new or renewed rental agreement or fixed-term lease constitutes a similar provision for the purposes of subparagraph (E) of paragraph (1) of subdivision (b) of Section 1946.2.\n\n(6) A property containing two separate dwelling units within a single structure in which the owner occupied one of the units as the owner",
      "scraped": "2026-01-26T02:29:01.904Z",
      "title": "Rent cap (AB 1482)",
      "keywords": ["rent cap", "rent increase", "AB 1482"]
    },
    {
      "code": "CIV",
      "section": "1950.5",
      "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=CIV&sectionNum=1950.5",
      "text": "(a) This section applies to security for a rental agreement for residential property that is used as the dwelling of the tenant.\n\n(b) As used in this section, “security” means any payment, fee, deposit, or charge, including, but not limited to, any payment, fee, deposit, or charge, except as provided in Section 1950.6, that is imposed at the beginning of the tenancy to be used to reimburse the landlord for costs associated with processing a new tenant or that is imposed as an advance payment of rent, used or to be used for any purpose, including, but not limited to, any of the following:\n\n(1) The compensation of a landlord for a tenant’s default in the payment of rent.\n\n(2) The repair of damages to the premises, exclusive of ordinary wear and tear, caused by the tenant or by a guest or licensee of the tenant.\n\n(3) The cleaning of the premises upon termination of the tenancy necessary to return the unit to the same level of cleanliness it was in at the inception of the tenancy. The amendments to this paragraph enacted by the act adding this sentence shall apply only to tenancies for which the tenant’s right to occupy begins after January 1, 2003.\n\n(4) To remedy future defaults by the tenant in any obligation under the rental agreement to restore, replace, or return personal property or appurtenances, exclusive of ordinary wear and tear, if the security deposit is authorized to be applied thereto by the rental agreement.\n\n(c) (1) Except as provided in paragraph (2), (3), or (5), a landlord shall not demand or receive security, however denominated, in an amount or value in excess of an amount equal to one month’s rent, in addition to any rent for the first month paid on or before initial occupancy.\n\n(2) This subdivision does not prohibit an advance payment of not less than six months’ rent if the term of the lease is six months or longer.\n\n(3) This subdivision does not preclude a landlord and a tenant from entering into a mutual agreement for the landlord, at the request of the tenant and for a specified fee or charge, to make structural, decorative, furnishing, or other similar alterations, if the alterations are other than cleaning or repairing for which the landlord may charge the previous tenant as provided by subdivision (e).\n\n(4) On or after April 1, 2025, if a landlord or its agent charges a service member who rents residential property in which the service member will reside a higher than standard or advertised security pursuant to paragraph (1) due to the credit history, credit score, housing history, or other factor related to the tenant, the landlord shall provide the tenant with a written statement, on or before the date the lease is signed, of the amount of the higher security and an explanation why the higher security amount is being charged. The additional amount of security shall be returned to the tenant after no more than six months of residency if the tenant is not in arrears for any rent due during that period. The date for return of the additional amount of security shall be included in the lease agreement. For purposes of this paragraph, “service member” has the same meaning as in Section 400 of the Military and Veterans Code.\n\n(5) (A) Notwithstanding paragraph (1), a landlord shall not demand or receive security, however denominated, in an amount or value in excess of an amount equal to two months’ rent, in addition to any rent for the first month paid on or before initial occupancy if the landlord meets both of the following requirements:\n\n(i) The landlord is a natural person or a limited liability company in which all members are natural persons.\n\n(ii) The landlord owns no more than two residential rental properties that collectively include no more than four dwelling units offered for rent.\n\n(B) Subparagraph (A) shall not apply if the prospective tenant is a service member. A landlord shall not refuse to enter into a rental agreement for residential property with a prospective tenant who is a service member because this subparagraph prohibits the landlord from demanding or receiving a greater amount of security than that which is established in paragraph (1). For purposes of this subparagraph, “service member” has the same meaning as in Section 400 of the Military and Veterans Code.\n\n(C) For purposes of this paragraph:\n\n(i) “Natural person” includes any natural person who is a settlor or beneficiary of a family trust.\n\n(ii) “Family trust” means a revocable living trust or irrevocable trust in which the settlors and beneficiaries of the trust are persons who are related to each other as sibling, spouse, domestic partner, child, parent, grandparent, or grandchild.\n\n(6) This subdivision shall not apply to a security collected or demanded by the landlord before July 1, 2024.\n\n(d) Any security shall be held by the landlord for the tenant who is party to the lease or agreement. The claim of a tenant to the security shall be prior to the claim of any creditor of the landlord.\n\n(e) (1) Subjec",
      "scraped": "2026-01-26T02:29:02.526Z",
      "title": "Security deposit rules",
      "keywords": ["security deposit", "refund", "deductions"]
    },
    {
      "code": "CIV",
      "section": "1950.7",
      "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=CIV&sectionNum=1950.7",
      "text": "(a) Any payment or deposit of money the primary function of which is to secure the performance of a rental agreement for other than residential property or any part of the agreement, other than a payment or deposit, including an advance payment of rent, made to secure the execution of a rental agreement, shall be governed by the provisions of this section. With respect to residential property, the provisions of Section 1950.5 shall prevail.\n\n(b) The payment or deposit of money shall be held by the landlord for the tenant who is party to the agreement. The claim of a tenant to the payment or deposit shall be prior to the claim of any creditor of the landlord, except a trustee in bankruptcy.\n\n(c) The landlord may claim of the payment or deposit only those amounts as are reasonably necessary to remedy tenant defaults in the payment of rent, to repair damages to the premises caused by the tenant, or to clean the premises upon termination of the tenancy, if the payment or deposit is made for any or all of those specific purposes.\n\n(1) If the claim of the landlord upon the payment or deposit is only for defaults in the payment of rent and the security deposit equals no more than one month’s rent plus a deposit amount clearly described as the payment of the last month’s rent, then any remaining portion of the payment or deposit shall be returned to the tenant at a time as may be mutually agreed upon by landlord and tenant, but in no event later than 30 days from the date the landlord receives possession of the premises.\n\n(2) If the claim of the landlord upon the payment or deposit is only for defaults in the payment of rent and the security deposit exceeds the amount of one month’s rent plus a deposit amount clearly described as the payment of the last month’s rent, then any remaining portion of the payment or deposit in excess of an amount equal to one month’s rent shall be returned to the tenant no later than two weeks after the date the landlord receives possession of the premises, with the remainder to be returned or accounted for within 30 days from the date the landlord receives possession of the premises.\n\n(3) If the claim of the landlord upon the payment or deposit includes amounts reasonably necessary to repair damages to the premises caused by the tenant or to clean the premises, then any remaining portion of the payment or deposit shall be returned to the tenant at a time as may be mutually agreed upon by landlord and tenant, but in no event later than 30 days from the date the landlord receives possession of the premises.\n\n(d) Upon termination of the landlord’s interest in the unit in question, whether by sale, assignment, death, appointment of receiver or otherwise, the landlord or the landlord’s agent shall, within a reasonable time, do one of the following acts, either of which shall relieve the landlord of further liability with respect to the payment or deposit:\n\n(1) Transfer the portion of the payment or deposit remaining after any lawful deductions made under subdivision (c) to the landlord’s successor in interest, and thereafter notify the tenant by personal delivery or certified mail of the transfer, of any claims made against the payment or deposit, and of the transferee’s name and address. If the notice to the tenant is made by personal delivery, the tenant shall acknowledge receipt of the notice and sign his or her name on the landlord’s copy of the notice.\n\n(2) Return the portion of the payment or deposit remaining after any lawful deductions made under subdivision (c) to the tenant.\n\n(e) Upon receipt of any portion of the payment or deposit under paragraph (1) of subdivision (d), the transferee shall have all of the rights and obligations of a landlord holding the payment or deposit with respect to the payment or deposit.\n\n(f) The bad faith retention by a landlord or transferee of a payment or deposit or any portion thereof, in violation of this section, may subject the landlord or the transferee to damages not to exceed two hundred dollars ($200), in addition to any actual damages.\n\n(g) This section is declarative of existing law and therefore operative as to all tenancies, leases, or rental agreements for other than residential property created or renewed on or after January 1, 1971.",
      "scraped": "2026-01-26T02:29:03.129Z",
      "title": "Last month rent as deposit",
      "keywords": ["last month", "deposit"]
    },
    {
      "code": "CIV",
      "section": "1954",
      "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=CIV&sectionNum=1954",
      "text": "(a) A landlord may enter the dwelling unit only in the following cases:\n\n(1) In case of emergency.\n\n(2) To make necessary or agreed repairs, decorations, alterations or improvements, supply necessary or agreed services, or exhibit the dwelling unit to prospective or actual purchasers, mortgagees, tenants, workers, or contractors or to make an inspection pursuant to subdivision (f) of Section 1950.5.\n\n(3) When the tenant has abandoned or surrendered the premises.\n\n(4) Pursuant to court order.\n\n(5) For the purposes set forth in Chapter 2.5 (commencing with Section 1954.201).\n\n(6) To comply with the provisions of Article 2.2 (commencing with Section 17973) of Chapter 5 of Part 1.5 of Division 13 of the Health and Safety Code.\n\n(b) Except in cases of emergency or when the tenant has abandoned or surrendered the premises, entry may not be made during other than normal business hours unless the tenant consents to an entry during other than normal business hours at the time of entry.\n\n(c) The landlord may not abuse the right of access or use it to harass the tenant.\n\n(d) (1) Except as provided in subdivision (e), or as provided in paragraph (2) or (3), the landlord shall give the tenant reasonable notice in writing of his or her intent to enter and enter only during normal business hours. The notice shall include the date, approximate time, and purpose of the entry. The notice may be personally delivered to the tenant, left with someone of a suitable age and discretion at the premises, or, left on, near, or under the usual entry door of the premises in a manner in which a reasonable person would discover the notice. Twenty-four hours shall be presumed to be reasonable notice in absence of evidence to the contrary. The notice may be mailed to the tenant. Mailing of the notice at least six days prior to an intended entry is presumed reasonable notice in the absence of evidence to the contrary.\n\n(2) If the purpose of the entry is to exhibit the dwelling unit to prospective or actual purchasers, the notice may be given orally, in person or by telephone, if the landlord or his or her agent has notified the tenant in writing within 120 days of the oral notice that the property is for sale and that the landlord or agent may contact the tenant orally for the purpose described above. Twenty-four hours is presumed reasonable notice in the absence of evidence to the contrary. The notice shall include the date, approximate time, and purpose of the entry. At the time of entry, the landlord or agent shall leave written evidence of the entry inside the unit.\n\n(3) The tenant and the landlord may agree orally to an entry to make agreed repairs or supply agreed services. The agreement shall include the date and approximate time of the entry, which shall be within one week of the agreement. In this case, the landlord is not required to provide the tenant a written notice.\n\n(e) No notice of entry is required under this section:\n\n(1) To respond to an emergency.\n\n(2) If the tenant is present and consents to the entry at the time of entry.\n\n(3) After the tenant has abandoned or surrendered the unit.",
      "scraped": "2026-01-26T02:29:03.748Z",
      "title": "Landlord right of access",
      "keywords": ["landlord access", "entry", "24 hours"]
    },
    {
      "code": "LAB",
      "section": "201",
      "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=LAB&sectionNum=201",
      "text": "(a) If an employer discharges an employee, the wages earned and unpaid at the time of discharge are due and payable immediately. An employer who lays off a group of employees by reason of the termination of seasonal employment in the curing, canning, or drying of any variety of perishable fruit, fish, or vegetables, shall be deemed to have made immediate payment when the wages of said employees are paid within a reasonable time as necessary for computation and payment thereof; provided, however, that the reasonable time shall not exceed 72 hours, and further provided that payment shall be made by mail to any employee who so requests and designates a mailing address therefor.\n\n(b) Notwithstanding any other law, the state employer shall be deemed to have made an immediate payment of wages under this section for any unused or accumulated vacation, annual leave, holiday leave, or time off to which the employee is entitled by reason of previous overtime work where compensating time off was given by the appointing power, provided, at least five workdays prior to his or her final day of employment, the employee submits a written election to his or her appointing power authorizing the state employer to tender payment for any or all leave to be contributed on a pretax basis or a Roth basis, in the year of discharge, to the employee’s account in a state-sponsored supplemental retirement plan as described under Sections 401(k), 403(b), or 457 of the Internal Revenue Code provided the plan allows those contributions. The contribution shall be deposited into the employee’s 401(k), 403(b), or 457 plan account no later than two and one-half months after the employee’s discharge from employment. This section is not intended to authorize contributions in excess of the annual deferral limits imposed under federal and state law or the provisions of the supplemental retirement plan itself.\n\n(c) Notwithstanding any other law, when the state employer discharges an employee, the employee may, at least five workdays prior to his or her final day of employment, submit a written election to his or her appointing power authorizing the state employer to defer into the next calendar year payment of any or all of the employee’s unused or accumulated vacation, annual leave, holiday leave, or time off to which the employee is entitled by reason of previous overtime work where compensating time off was given by the appointing power. An employee electing to defer payment into the next calendar year under this section may do any of the following:\n\n(1) Contribute the entire payment to his or her 401(k), 403(b), or 457 plan account.\n\n(A) This election is only available if the employee is terminated from service on or after November 1 of the calendar year of his or her termination.\n\n(B) The contributions shall be deposited into an applicable plan account no later than two and one-half months after the employee’s last day of employment.\n\n(2) Contribute any portion of the deferred payment to his or her 401(k), 403(b), or 457 plan account and receive cash payment for the remaining noncontributed unused leave.\n\n(A) An employee is eligible to defer a portion of the deferred payment into a 401(k), 403(b), or 457 plan account only if the employee’s date of termination from service was on or after November 1 of the calendar year of his or her termination.\n\n(B) For the portion deferred into a 401(k), 403(b), or 457 plan account, the contributions shall be deposited into an applicable plan account no later than two and one-half months after the employee’s last day of employment.\n\n(C) For the portion received as a cash payment:\n\n(i) Only that portion of leave that extends past the November pay period for the employee shall be deferred into the next calendar year.\n\n(ii) Payments shall be tendered under this paragraph no later than February 1 in the year following the employee’s last day of employment.\n\n(3) Receive a lump-sum payment for all of the deferred unused leave as described above.\n\n(A) Only that portion of leave that extends past the November pay period for the employee shall be deferred into the next calendar year.\n\n(B) Payments shall be tendered under this paragraph no later than February 1 in the year following the employee’s last day of employment.\n\n(d) This section is not intended to authorize contributions in excess of the annual deferral limits imposed under federal and state law or the provisions of the supplemental retirement plan itself.",
      "scraped": "2026-01-26T02:29:04.338Z",
      "title": "Final wages - discharge",
      "keywords": ["final paycheck", "fired", "terminated"]
    },
    {
      "code": "LAB",
      "section": "202",
      "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=LAB&sectionNum=202",
      "text": "(a) If an employee not having a written contract for a definite period quits his or her employment, his or her wages shall become due and payable not later than 72 hours thereafter, unless the employee has given 72 hours previous notice of his or her intention to quit, in which case the employee is entitled to his or her wages at the time of quitting. Notwithstanding any other law, an employee who quits without providing a 72-hour notice shall be entitled to receive payment by mail if he or she so requests and designates a mailing address. The date of the mailing shall constitute the date of payment for purposes of the requirement to provide payment within 72 hours of the notice of quitting.\n\n(b) Notwithstanding any other law, the state employer shall be deemed to have made an immediate payment of wages under this section for any unused or accumulated vacation, annual leave, holiday leave, sick leave to which the employee is otherwise entitled due to a disability retirement, or time off to which the employee is entitled by reason of previous overtime work where compensating time off was given by the appointing power, provided at least five workdays prior to his or her final day of employment, the employee submits a written election to his or her appointing power authorizing the state employer to tender payment for any or all leave to be contributed on a pretax basis or a Roth basis, in the year of separation, to the employee’s account in a state-sponsored supplemental retirement plan as described under Sections 401(k), 403(b), or 457 of the Internal Revenue Code provided the plan allows those contributions. The contribution shall be deposited into the employee’s 401(k), 403(b), or 457 plan account no later than two and one-half months after the employee’s final day of employment. This section is not intended to authorize contributions in excess of the annual deferral limits imposed under federal and state law or the provisions of the supplemental retirement plan itself.\n\n(c) Notwithstanding any other law, when a state employee quits, retires, or disability retires from his or her employment with the state, the employee may, at least five workdays prior to his or her final day of employment, submit a written election to his or her appointing power authorizing the state employer to defer into the next calendar year payment of any or all of the employee’s unused or accumulated vacation, annual leave, holiday leave, sick leave to which the employee is otherwise entitled due to a disability, retirement, or time off to which the employee is entitled by reason of previous overtime work where compensating time off was given by the appointing power. The employee may elect any of the following:\n\n(1) Contribute the entire payment to his or her 401(k), 403(b), or 457 plan account.\n\n(A) This election is only available if the employee’s last day of employment is on or after November 1 of the calendar year of his or her last day of employment.\n\n(B) The contributions shall be deposited into the applicable plan account no later than two and one-half months after the employee’s last day of employment.\n\n(2) Contribute any portion of the deferred payment to his or her 401(k), 403(b), or 457 plan account and receive cash payment for the remaining noncontributed unused leave.\n\n(A) An employee is eligible to defer a portion of the deferred payment into a 401(k), 403(b), or 457 plan account only if the employee’s last day of employment was on or after November 1 of the calendar year of his or her last day of employment.\n\n(B) For the portion deferred into a 401(k), 403(b), or 457 plan account, the contributions shall be deposited into an applicable plan account no later than two and one-half months after the employee’s last day of employment.\n\n(C) For the portion received as a cash payment:\n\n(i) Only that portion of leave that extends past the November pay period for the employee shall be deferred into the next calendar year.\n\n(ii) Payments shall be tendered under this paragraph no later than February 1 in the year following the employee’s last day of employment.\n\n(3) Receive a lump-sum payment for all of the deferred unused leave as described above.\n\n(A) Only that portion of leave that extends past the November pay period for the employee shall be deferred into the next calendar year.\n\n(B) Payments shall be tendered under this section no later than February 1 in the year following the employee’s last day of employment.\n\n(d) This section is not intended to authorize contributions in excess of the annual deferral limits imposed under federal and state law or the provisions of the supplemental retirement plan itself.",
      "scraped": "2026-01-26T02:29:04.926Z",
      "title": "Final wages - quit",
      "keywords": ["final paycheck", "quit", "resignation"]
    },
    {
      "code": "LAB",
      "section": "203",
      "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=LAB&sectionNum=203",
      "text": "(a) If an employer willfully fails to pay, without abatement or reduction, in accordance with Sections 201, 201.3, 201.5, 201.6, 201.8, 201.9, 202, and 205.5, any wages of an employee who is discharged or who quits, the wages of the employee shall continue as a penalty from the due date thereof at the same rate until paid or until an action therefor is commenced; but the wages shall not continue for more than 30 days. An employee who secretes or absents themselves to avoid payment to them, or who refuses to receive the payment when fully tendered to them, including any penalty then accrued under this section, is not entitled to any benefit under this section for the time during which the employee so avoids payment.\n\n(b) Suit may be filed for these penalties at any time before the expiration of the statute of limitations on an action for the wages from which the penalties arise.",
      "scraped": "2026-01-26T02:29:05.516Z",
      "title": "Penalty for late wages",
      "keywords": ["waiting time penalty", "late pay"]
    },
    {
      "code": "LAB",
      "section": "226",
      "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=LAB&sectionNum=226",
      "text": "(a) An employer, semimonthly or at the time of each payment of wages, shall furnish to their employee, either as a detachable part of the check, draft, or voucher paying the employee’s wages, or separately if wages are paid by personal check or cash, an accurate itemized statement in writing showing (1) gross wages earned, (2) total hours worked by the employee, except as provided in subdivision (j), (3) the number of piece-rate units earned and any applicable piece rate if the employee is paid on a piece-rate basis, (4) all deductions, provided that all deductions made on written orders of the employee may be aggregated and shown as one item, (5) net wages earned, (6) the inclusive dates of the period for which the employee is paid, (7) the name of the employee and only the last four digits of their social security number or an employee identification number other than a social security number, (8) the name and address of the legal entity that is the employer and, if the employer is a farm labor contractor, as defined in subdivision (b) of Section 1682, the name and address of the legal entity that secured the services of the employer, and (9) all applicable hourly rates in effect during the pay period and the corresponding number of hours worked at each hourly rate by the employee and, beginning July 1, 2013, if the employer is a temporary services employer as defined in Section 201.3, the rate of pay and the total hours worked for each temporary services assignment. The deductions made from payment of wages shall be recorded in ink or other indelible form, properly dated, showing the month, day, and year, and a copy of the statement and the record of the deductions shall be kept on file by the employer for at least three years at the place of employment or at a central location within the State of California. For purposes of this subdivision, “copy” includes a duplicate of the itemized statement provided to an employee or a computer-generated record that accurately shows all of the information required by this subdivision.\n\n(b) An employer that is required by this code or any regulation adopted pursuant to this code to keep the information required by subdivision (a) shall afford current and former employees the right to inspect or receive a copy of records pertaining to their employment, upon reasonable request to the employer. The employer may take reasonable steps to ensure the identity of a current or former employee. If the employer provides copies of the records, the actual cost of reproduction may be charged to the current or former employee.\n\n(c) An employer who receives a written or oral request to inspect or receive a copy of records pursuant to subdivision (b) pertaining to a current or former employee shall comply with the request as soon as practicable, but no later than 21 calendar days from the date of the request. A violation of this subdivision is an infraction. Impossibility of performance, not caused by or a result of a violation of law, shall be an affirmative defense for an employer in any action alleging a violation of this subdivision. An employer may designate the person to whom a request under this subdivision will be made.\n\n(d) This section does not apply to any employer of a person employed by the owner or occupant of a residential dwelling whose duties are incidental to the ownership, maintenance, or use of the dwelling, including the care and supervision of children, or whose duties are personal and not in the course of the trade, business, profession, or occupation of the owner or occupant.\n\n(e) (1) An employee suffering injury as a result of a knowing and intentional failure by an employer to comply with subdivision (a) is entitled to recover the greater of all actual damages or fifty dollars ($50) for the initial pay period in which a violation occurs and one hundred dollars ($100) per employee for each violation in a subsequent pay period, not to exceed an aggregate penalty of four thousand dollars ($4,000), and is entitled to an award of costs and reasonable attorney’s fees.\n\n(2) (A) An employee is deemed to suffer injury for purposes of this subdivision if the employer fails to provide a wage statement.\n\n(B) An employee is deemed to suffer injury for purposes of this subdivision if the employer fails to provide accurate and complete information as required by any one or more of items (1) to (9), inclusive, of subdivision (a) and the employee cannot promptly and easily determine from the wage statement alone one or more of the following:\n\n(i) The amount of the gross wages or net wages paid to the employee during the pay period or any of the other information required to be provided on the itemized wage statement pursuant to items (2) to (4), inclusive, (6), and (9) of subdivision (a).\n\n(ii) Which deductions the employer made from gross wages to determine the net wages paid to the employee during the pay period. Nothing in this subdivision alters the ability of the employ",
      "scraped": "2026-01-26T02:29:06.122Z",
      "title": "Pay stub requirements",
      "keywords": ["pay stub", "itemized statement"]
    },
    {
      "code": "LAB",
      "section": "246",
      "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=LAB&sectionNum=246",
      "text": "(a) (1) An employee who, on or after July 1, 2015, works in California for the same employer for 30 or more days within a year from the commencement of employment is entitled to paid sick days as specified in this section. For an individual provider of waiver personal care services under Section 14132.97 of the Welfare and Institutions Code who also provides in-home supportive services in an applicable month, eligibility shall be determined based on the aggregate number of monthly hours worked between in-home supportive services and waiver personal care services pursuant to subdivision (d) of Section 14132.971.\n\n(2) On and after July 1, 2018, a provider of in-home supportive services under Section 14132.95, 14132.952, or 14132.956 of, or Article 7 (commencing with Section 12300) of Chapter 3 of Part 3 of Division 9 of, the Welfare and Institutions Code, who works in California for 30 or more days within a year from the commencement of employment is entitled to paid sick days as specified in subdivision (e) and subject to the rate of accrual in paragraph (1) of subdivision (b). For an individual provider of waiver personal care services under Section 14132.97 of the Welfare and Institutions Code, entitlement to paid sick days begins on July 1, 2019.\n\n(b) (1) An employee shall accrue paid sick days at the rate of not less than one hour per every 30 hours worked, beginning at the commencement of employment or the operative date of this article, whichever is later, subject to the use and accrual limitations set forth in this section.\n\n(2) An employee who is exempt from overtime requirements as an administrative, executive, or professional employee under a wage order of the Industrial Welfare Commission is deemed to work 40 hours per workweek for the purposes of this section, unless the employee’s normal workweek is less than 40 hours, in which case the employee shall accrue paid sick days based upon that normal workweek.\n\n(3) An employer may use a different accrual method, other than providing one hour per every 30 hours worked, provided that the accrual is on a regular basis so that an employee has no less than 24 hours of accrued sick leave or paid time off by the 120th calendar day of employment or each calendar year, or in each 12-month period, and no less than 40 hours of accrued sick leave or paid time off by the 200th calendar day of employment or each calendar year, or in each 12-month period.\n\n(4) An employer may satisfy the accrual requirements of this section by providing not less than 24 hours or 3 days of paid sick leave that is available to the employee to use by the completion of the employee’s 120th calendar day of employment, and no less than 40 hours or 5 days of paid sick leave that is available to the employee to use by the completion of the employee’s 200th calendar day of employment.\n\n(c) An employee shall be entitled to use accrued paid sick days beginning on the 90th day of employment, after which day the employee may use paid sick days as they are accrued.\n\n(d) Accrued paid sick days shall carry over to the following year of employment. However, an employer may limit an employee’s use of accrued paid sick days to 40 hours or five days in each year of employment, calendar year, or 12-month period. This section shall be satisfied and no accrual or carryover is required if the full amount of leave is received at the beginning of each year of employment, calendar year, or 12-month period. The term “full amount of leave” means five days or 40 hours.\n\n(e) For a provider of in-home supportive services under Section 14132.95, 14132.952, or 14132.956 of, or Article 7 (commencing with Section 12300) of Chapter 3 of Part 3 of Division 9 of, and an individual provider of waiver personal care services under Section 14132.97 of, the Welfare and Institutions Code, the term “full amount of leave” is defined as follows:\n\n(1) Eight hours or one day in each year of employment, calendar year, or 12-month period beginning July 1, 2018.\n\n(2) Sixteen hours or two days in each year of employment, calendar year, or 12-month period beginning when the minimum wage, as set forth in paragraph (1) of subdivision (b) of Section 1182.12 and accounting for any years postponed under subparagraph (D) of paragraph (3) of subdivision (d) of Section 1182.12, has reached thirteen dollars ($13) per hour.\n\n(3) Twenty-four hours or three days in each year of employment, calendar year, or 12-month period beginning when the minimum wage, as set forth in paragraph (1) of subdivision (b) of Section 1182.12 and accounting for any years postponed under subparagraph (D) of paragraph (3) of subdivision (d) of Section 1182.12, has reached fifteen dollars ($15) per hour.\n\n(4) Forty hours or five days in each year of employment, calendar year, or 12-month period beginning January 1, 2024.\n\n(f) An employer is not required to provide additional paid sick days pursuant to this section if the employer has a paid leave policy or paid time off ",
      "scraped": "2026-01-26T02:29:06.733Z",
      "title": "Paid sick leave",
      "keywords": ["sick leave", "paid sick", "illness"]
    },
    {
      "code": "LAB",
      "section": "510",
      "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=LAB&sectionNum=510",
      "text": "(a) Eight hours of labor constitutes a day’s work. Any work in excess of eight hours in one workday and any work in excess of 40 hours in any one workweek and the first eight hours worked on the seventh day of work in any one workweek shall be compensated at the rate of no less than one and one-half times the regular rate of pay for an employee. Any work in excess of 12 hours in one day shall be compensated at the rate of no less than twice the regular rate of pay for an employee. In addition, any work in excess of eight hours on any seventh day of a workweek shall be compensated at the rate of no less than twice the regular rate of pay of an employee. Nothing in this section requires an employer to combine more than one rate of overtime compensation in order to calculate the amount to be paid to an employee for any hour of overtime work. The requirements of this section do not apply to the payment of overtime compensation to an employee working pursuant to any of the following:\n\n(1) An alternative workweek schedule adopted pursuant to Section 511.\n\n(2) An alternative workweek schedule adopted pursuant to a collective bargaining agreement pursuant to Section 514.\n\n(3) An alternative workweek schedule to which this chapter is inapplicable pursuant to Section 554.\n\n(b) Time spent commuting to and from the first place at which an employee’s presence is required by the employer shall not be considered to be a part of a day’s work, when the employee commutes in a vehicle that is owned, leased, or subsidized by the employer and is used for the purpose of ridesharing, as defined in Section 522 of the Vehicle Code.\n\n(c) This section does not affect, change, or limit an employer’s liability under the workers’ compensation law.",
      "scraped": "2026-01-26T02:29:07.318Z",
      "title": "Overtime requirements",
      "keywords": ["overtime", "hours", "time and half"]
    },
    {
      "code": "LAB",
      "section": "512",
      "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=LAB&sectionNum=512",
      "text": "(a) An employer shall not employ an employee for a work period of more than five hours per day without providing the employee with a meal period of not less than 30 minutes, except that if the total work period per day of the employee is no more than six hours, the meal period may be waived by mutual consent of both the employer and employee. An employer shall not employ an employee for a work period of more than 10 hours per day without providing the employee with a second meal period of not less than 30 minutes, except that if the total hours worked is no more than 12 hours, the second meal period may be waived by mutual consent of the employer and the employee only if the first meal period was not waived.\n\n(b) (1) Notwithstanding subdivision (a), the Industrial Welfare Commission may adopt a working condition order permitting a meal period to commence after six hours of work if the commission determines that the order is consistent with the health and welfare of the affected employees.\n\n(2) Notwithstanding paragraph (1), a commercial driver employed by a motor carrier transporting nutrients and byproducts from a commercial feed manufacturer subject to Section 15051 of the Food and Agricultural Code to a customer located in a remote rural location may commence a meal period after six hours of work, if the regular rate of pay of the driver is no less than one and one-half times the state minimum wage and the driver receives overtime compensation in accordance with Section 510.\n\n(c) Subdivision (a) does not apply to an employee in the wholesale baking industry who is subject to an Industrial Welfare Commission wage order and who is covered by a valid collective bargaining agreement that provides for a 35-hour workweek consisting of five 7-hour days, payment of one and one-half times the regular rate of pay for time worked in excess of seven hours per day, and a rest period of not less than 10 minutes every two hours.\n\n(d) If an employee in the motion picture industry or the broadcasting industry, as those industries are defined in Industrial Welfare Commission Wage Order Numbers 11 and 12, is covered by a valid collective bargaining agreement that provides for meal periods and includes a monetary remedy if the employee does not receive a meal period required by the agreement, then the terms, conditions, and remedies of the agreement pertaining to meal periods apply in lieu of the applicable provisions pertaining to meal periods of subdivision (a) of this section, Section 226.7, and Industrial Welfare Commission Wage Order Numbers 11 and 12.\n\n(e) Subdivisions (a) and (b) do not apply to an employee specified in subdivision (f) if both of the following conditions are satisfied:\n\n(1) The employee is covered by a valid collective bargaining agreement.\n\n(2) The valid collective bargaining agreement expressly provides for the wages, hours of work, and working conditions of employees, and expressly provides for meal periods for those employees, final and binding arbitration of disputes concerning application of its meal period provisions, premium wage rates for all overtime hours worked, and a regular hourly rate of pay of not less than 30 percent more than the state minimum wage rate.\n\n(f) Subdivision (e) applies to each of the following employees:\n\n(1) An employee employed in a construction occupation.\n\n(2) An employee employed as a commercial driver.\n\n(3) An employee employed in the security services industry as a security officer who is registered pursuant to Chapter 11.5 (commencing with Section 7580) of Division 3 of the Business and Professions Code, and who is employed by a private patrol operator registered pursuant to that chapter.\n\n(4) An employee employed by an electrical corporation, a gas corporation, a water corporation, or a local publicly owned electric utility.\n\n(g) The following definitions apply for the purposes of this section:\n\n(1) “Commercial driver” means an employee who operates a vehicle described in Section 260 or 462 of, or subdivision (b) of Section 15210 of, the Vehicle Code.\n\n(2) “Construction occupation” means all job classifications associated with construction by Article 2 (commencing with Section 7025) of Chapter 9 of Division 3 of the Business and Professions Code, including work involving alteration, demolition, building, excavation, renovation, remodeling, maintenance, improvement, and repair, and any other similar or related occupation or trade.\n\n(3) “Electrical corporation” has the same meaning as provided in Section 218 of the Public Utilities Code.\n\n(4) “Gas corporation” has the same meaning as provided in Section 222 of the Public Utilities Code.\n\n(5) “Local publicly owned electric utility” has the same meaning as provided in Section 224.3 of the Public Utilities Code.\n\n(6) “Water corporation” has the same meaning as provided in Section 241 of the Public Utilities Code.",
      "scraped": "2026-01-26T02:29:07.926Z",
      "title": "Meal periods",
      "keywords": ["meal break", "lunch", "30 minutes"]
    },
    {
      "code": "LAB",
      "section": "1194",
      "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=LAB&sectionNum=1194",
      "text": "(a) Notwithstanding any agreement to work for a lesser wage, any employee receiving less than the legal minimum wage or the legal overtime compensation applicable to the employee is entitled to recover in a civil action the unpaid balance of the full amount of this minimum wage or overtime compensation, including interest thereon, reasonable attorney’s fees, and costs of suit.\n\n(b) The amendments made to this section by Chapter 825 of the Statutes of 1991 shall apply only to civil actions commenced on or after January 1, 1992.",
      "scraped": "2026-01-26T02:29:08.516Z",
      "title": "Minimum wage recovery",
      "keywords": ["minimum wage", "underpaid"]
    },
    {
      "code": "LAB",
      "section": "1197",
      "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=LAB&sectionNum=1197",
      "text": "The minimum wage for employees fixed by the commission or by any applicable state or local law, is the minimum wage to be paid to employees, and the payment of a lower wage than the minimum so fixed is unlawful. This section does not change the applicability of local minimum wage laws to any entity.",
      "scraped": "2026-01-26T02:29:09.111Z",
      "title": "Minimum wage requirement",
      "keywords": ["minimum wage", "hourly rate"]
    },
    {
      "code": "LAB",
      "section": "2802",
      "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=LAB&sectionNum=2802",
      "text": "(a) An employer shall indemnify his or her employee for all necessary expenditures or losses incurred by the employee in direct consequence of the discharge of his or her duties, or of his or her obedience to the directions of the employer, even though unlawful, unless the employee, at the time of obeying the directions, believed them to be unlawful.\n\n(b) All awards made by a court or by the Division of Labor Standards Enforcement for reimbursement of necessary expenditures under this section shall carry interest at the same rate as judgments in civil actions. Interest shall accrue from the date on which the employee incurred the necessary expenditure or loss.\n\n(c) For purposes of this section, the term “necessary expenditures or losses” shall include all reasonable costs, including, but not limited to, attorney’s fees incurred by the employee enforcing the rights granted by this section.\n\n(d) In addition to recovery of penalties under this section in a court action or proceedings pursuant to Section 98, the commissioner may issue a citation against an employer or other person acting on behalf of the employer who violates reimbursement obligations for an amount determined to be due to an employee under this section. The procedures for issuing, contesting, and enforcing judgments for citations or civil penalties issued by the commissioner shall be the same as those set forth in Section 1197.1. Amounts recovered pursuant to this section shall be paid to the affected employee.",
      "scraped": "2026-01-26T02:29:09.721Z",
      "title": "Expense reimbursement",
      "keywords": ["expense", "reimbursement", "mileage"]
    },
    {
      "code": "FAM",
      "section": "2100",
      "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=FAM&sectionNum=2100",
      "text": "The Legislature finds and declares the following:\n\n(a) It is the policy of the State of California (1) to marshal, preserve, and protect community and quasi-community assets and liabilities that exist at the date of separation so as to avoid dissipation of the community estate before distribution, (2) to ensure fair and sufficient child and spousal support awards, and (3) to achieve a division of community and quasi-community assets and liabilities on the dissolution or nullity of marriage or legal separation of the parties as provided under California law.\n\n(b) Sound public policy further favors the reduction of the adversarial nature of marital dissolution and the attendant costs by fostering full disclosure and cooperative discovery.\n\n(c) In order to promote this public policy, a full and accurate disclosure of all assets and liabilities in which one or both parties have or may have an interest must be made in the early stages of a proceeding for dissolution of marriage or legal separation of the parties, regardless of the characterization as community or separate, together with a disclosure of all income and expenses of the parties. Moreover, each party has a continuing duty to immediately, fully, and accurately update and augment that disclosure to the extent there have been any material changes so that at the time the parties enter into an agreement for the resolution of any of these issues, or at the time of trial on these issues, each party will have a full and complete knowledge of the relevant underlying facts.",
      "scraped": "2026-01-26T02:29:10.323Z",
      "title": "Disclosure requirements",
      "keywords": ["divorce", "disclosure", "assets"]
    },
    {
      "code": "FAM",
      "section": "3020",
      "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=FAM&sectionNum=3020",
      "text": "(a) The Legislature finds and declares that it is the public policy of this state to ensure that the health, safety, and welfare of children shall be the court’s primary concern in determining the best interests of children when making any orders regarding the physical or legal custody or visitation of children. The Legislature further finds and declares that children have the right to be safe and free from abuse, and that the perpetration of child abuse or domestic violence in a household where a child resides is detrimental to the health, safety, and welfare of the child.\n\n(b) The Legislature finds and declares that it is the public policy of this state to ensure that children have frequent and continuing contact with both parents after the parents have separated or dissolved their marriage, or ended their relationship, and to encourage parents to share the rights and responsibilities of child rearing in order to effect this policy, except when the contact would not be in the best interests of the child, as provided in subdivisions (a) and (c) of this section and Section 3011.\n\n(c) When the policies set forth in subdivisions (a) and (b) of this section are in conflict, a court’s order regarding physical or legal custody or visitation shall be made in a manner that ensures the health, safety, and welfare of the child and the safety of all family members.\n\n(d) The Legislature finds and declares that it is the public policy of this state to ensure that the sex, gender identity, gender expression, or sexual orientation of a parent, legal guardian, or relative is not considered in determining the best interests of the child.",
      "scraped": "2026-01-26T02:29:10.934Z",
      "title": "Best interest of child",
      "keywords": ["child custody", "best interest"]
    },
    {
      "code": "FAM",
      "section": "3040",
      "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=FAM&sectionNum=3040",
      "text": "(a) Custody should be granted in the following order of preference according to the best interest of the child as provided in Sections 3011 and 3020:\n\n(1) To both parents jointly pursuant to Chapter 4 (commencing with Section 3080) or to either parent. In making an order granting custody to either parent, the court shall consider, among other factors, which parent is more likely to allow the child frequent and continuing contact with the noncustodial parent, consistent with Sections 3011 and 3020. The court, in its discretion, may require the parents to submit to the court a plan for the implementation of the custody order.\n\n(2) If to neither parent, to the person or persons in whose home the child has been living in a wholesome and stable environment.\n\n(3) To any other person or persons deemed by the court to be suitable and able to provide adequate and proper care and guidance for the child.\n\n(b) The immigration status of a parent, legal guardian, or relative shall not disqualify the parent, legal guardian, or relative from receiving custody under subdivision (a).\n\n(c) The court shall not consider the sex, gender identity, gender expression, or sexual orientation of a parent, legal guardian, or relative in determining the best interest of the child under subdivision (a).\n\n(d) (1) Commencing January 1, 2024, if a court finds that the effects of a parent’s, legal guardian’s, or relative’s history of or current mental illness are a factor in determining the best interest of the child under subdivision (a), the court shall do both of the following:\n\n(A) Provide the parent, legal guardian, or relative with a list of local resources for mental health treatment.\n\n(B) State its reasons for the finding in writing or on the record.\n\n(2) This subdivision does not relieve a court from ensuring that the health, safety, and welfare of the child is the court’s primary concern in determining the best interests of children when making any order regarding the physical or legal custody, or visitation, of the child.\n\n(e) This section establishes neither a preference nor a presumption for or against joint legal custody, joint physical custody, or sole custody, but allows the court and the family the widest discretion to choose a parenting plan that is in the best interest of the child, consistent with this section.\n\n(f) In cases where a child has more than two parents, the court shall allocate custody and visitation among the parents based on the best interest of the child, including, but not limited to, addressing the child’s need for continuity and stability by preserving established patterns of care and emotional bonds. The court may order that not all parents share legal or physical custody of the child if the court finds that it would not be in the best interest of the child as provided in Sections 3011 and 3020.",
      "scraped": "2026-01-26T02:29:11.540Z",
      "title": "Custody order priorities",
      "keywords": ["custody", "parent", "order"]
    },
    {
      "code": "FAM",
      "section": "3100",
      "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=FAM&sectionNum=3100",
      "text": "(a) In making an order pursuant to Chapter 4 (commencing with Section 3080), the court shall grant reasonable visitation rights to a parent when it is shown that the visitation would be in the best interest of the child, as defined in Section 3011, and consistent with Section 3020. In the discretion of the court, reasonable visitation rights may be granted to any other person having an interest in the welfare of the child.\n\n(b) (1) (A) If a protective order, as defined in Section 6218 of this code or Section 136.2 of the Penal Code, has been issued restraining a parent, the court shall consider whether the best interest of the child requires that visitation by that parent be suspended, denied, or limited to situations in which a third person, specified by the court, is present, including virtual visitation.\n\n(B) A parent may submit to the court the name of a person who the parent deems suitable to be present during visitation.\n\n(C) The court may order supervised visitation with the person whose name was submitted, but the submission of a name does not require the court to order supervised visitation if it is not in the best interest of the child, nor does a parent’s submission of a name constitute agreement or stipulation to supervised visitation.\n\n(2) In determining the type of visitation with the restrained party, if any, is in the best interest of the child pursuant to paragraph (1), the court shall consider the nature of the acts that led to the protective order, the period of time that has elapsed since that order, and whether the restrained party has committed further acts of abuse.\n\n(c) (1) (A) If the court has found that circumstances warrant making an order granting or modifying a custody order on an ex parte basis under Section 3064, the court shall consider whether the best interest of the child requires that visitation by the party whose conduct presents a risk of immediate harm to the child or immediate risk that the child will be removed from the State of California should be suspended, denied, or limited to situations in which a third person, specified by the court, is present, including virtual visitation.\n\n(B) A parent may submit to the court the name of a person who the parent deems suitable to be present during visitation, which may be accepted or rejected by the court as set forth in subparagraph (C) of paragraph (1) of subdivision (b).\n\n(2) In determining the type of visitation with the party whose conduct presents a risk of immediate harm to the child or immediate risk that the child will be removed from the State of California, if any, is in the best interest of the child pursuant to paragraph (1), the court shall consider the nature of the acts that led to the finding of the risk of immediate harm or immediate risk of removal.\n\n(d) If visitation is ordered in a case in which domestic violence is alleged and an emergency protective order, protective order, or other restraining order has been issued, the visitation order shall specify the time, day, place, and manner of the visitation, including virtual visitation, or any transfer of the child, so as to limit the child’s exposure to potential domestic conflict or abuse, to ensure the safety of all family members, and to minimize any opportunity for the use of abuse, including coercive control. If a criminal protective order has been issued pursuant to Section 136.2 of the Penal Code, the visitation order shall make reference to, and, unless there is an emergency protective order that has precedence in enforcement pursuant to paragraph (1) of subdivision (c) of Section 136.2 of the Penal Code or a no-contact order, as described in Section 6320, acknowledge the precedence of enforcement of, an appropriate criminal protective order.\n\n(e) (1) If the court finds a party is staying in a place designated as a shelter for victims of domestic violence or other confidential location, the court’s order shall be designed to prevent disclosure of the location of the shelter or other confidential location and to protect all adults and children living in that location.\n\n(2) If a court finds that a parent is residing in a confidential shelter due to domestic violence or fear of domestic violence from the other parent, the court shall order in-person visitation with the other parent only if the court finds that in-person visitation is in the best interest of the child, taking into account all of the following:\n\n(A) The other parent’s access to firearms and ammunition, including, but not limited to, whether the other parent is prohibited from having firearms and ammunition.\n\n(B) If a parent is the subject of an emergency protective order, protective order, or other restraining order, whether that parent has violated that order, and the nature of any violation.\n\n(C) Information obtained pursuant to Section 6306, the requirements of this section, and the information obtained pursuant to Section 3011.\n\n(D) The potential for disclosure of the confidential l",
      "scraped": "2026-01-26T02:29:12.145Z",
      "title": "Visitation rights",
      "keywords": ["visitation", "parenting time"]
    },
    {
      "code": "FAM",
      "section": "4055",
      "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=FAM&sectionNum=4055",
      "text": "(a) The statewide uniform guideline for determining child support orders is as follows: CS = K[HN - (H%)(TN)].\n\n(b) (1) The components of the formula are as follows:\n\n(A) CS = child support amount.\n\n(B) K = amount of both parents’ income to be allocated for child support as set forth in paragraph (3).\n\n(C) HN = high earner’s net monthly disposable income.\n\n(D) H% = approximate percentage of time that the high earner has or will have primary physical responsibility for the children compared to the other parent. In cases in which parents have different time-sharing arrangements for different children, H% equals the average of the approximate percentages of time the high earner parent spends with each child.\n\n(E) TN = total net monthly disposable income of both parties.\n\n(2) To compute net disposable income, see Section 4059.\n\n(3) K (amount of both parents’ income allocated for child support) equals one plus H% (if H% is less than or equal to 50 percent) or two minus H% (if H% is greater than 50 percent) times the following fraction:\n\nTotal Net Disposable Income Per Month\n\n0.165 + TN/82,857\n\n$2,901–5,000\n\n0.131 + TN/42,149\n\n$5,001–10,000\n\n$10,001–15,000\n\n0.10 + 1,499/TN\n\nOver $15,000\n\n0.12 + 1,200/TN\n\nFor example, if H% equals 20 percent and the total monthly net disposable income of the parents is $1,000, K = (1 + 0.20) × (0.165 + 1,000/82,857), or 0.21. If H% equals 80 percent and the total monthly net disposable income of the parents is $1,000, K = (2 - 0.80) × (0.165 + 1,000/82,857), or 0.21.\n\n(4) For more than one child, multiply CS by:\n\n10 children\n\n(5) If the amount calculated under the formula results in a positive number, the higher earner shall pay that amount to the lower earner. If the amount calculated under the formula results in a negative number, the lower earner shall pay the absolute value of that amount to the higher earner.\n\n(6) In any default proceeding where proof is by affidavit pursuant to Section 2336, or in any proceeding for child support in which a party fails to appear after being duly noticed, H% shall be set at zero in the formula if the noncustodial parent is the higher earner or at 100 if the custodial parent is the higher earner, where there is no evidence presented demonstrating the percentage of time that the noncustodial parent has primary physical responsibility for the children. H% shall not be set as described in paragraph (3) if the moving party in a default proceeding is the noncustodial parent or if the party who fails to appear after being duly noticed is the custodial parent. A statement by the party who is not in default as to the percentage of time that the noncustodial parent has primary physical responsibility for the children shall be deemed sufficient evidence.\n\n(7) In all cases in which the net disposable income per month of the obligor is less than the amount of monthly gross income earned from full-time minimum wage, established by Section 1182.12 of the Labor Code, at 40 hours per week, 52 weeks per year, there is a rebuttable presumption that the obligor is entitled to a low-income adjustment. The presumption may be rebutted by evidence showing that the application of the lowest amount of child support permitted pursuant to this paragraph would be unjust and inappropriate in the particular case. In determining whether the presumption is rebutted, the court shall consider the principles provided in Section 4053, and the impact of the contemplated adjustment on the respective net incomes of the obligor and the obligee. The low-income adjustment shall reduce the child support amount otherwise determined under this section by an amount that is no greater than the amount calculated by multiplying the child support amount otherwise determined under this section by a fraction, the numerator of which is the amount of monthly gross income earned from full-time minimum wage, established by Section 1182.12 of the Labor Code, at 40 hours per week, 52 weeks per year, minus the obligor’s net disposable income per month, and the denominator of which is the amount of monthly gross income earned from full-time minimum wage, established by Section 1182.12 of the Labor Code, at 40 hours per week, 52 weeks per year.\n\n(8) Unless the court orders otherwise, the order for child support shall allocate the support amount so that the amount of support for the youngest child is the amount of support for one child, and the amount for the next youngest child is the difference between that amount and the amount for two children, with similar allocations for additional children. However, this paragraph does not apply to cases in which there are different time-sharing arrangements for different children or where the court determines that the allocation would be inappropriate in the particular case.\n\n(c) If a court uses a computer to calculate the child support order and the obligor’s income qualifies for a low-income adjustment, the computer program shall provide the range of the adjust",
      "scraped": "2026-01-26T02:29:12.746Z",
      "title": "Child support calculation",
      "keywords": ["child support", "calculation", "guideline"]
    },
    {
      "code": "VEH",
      "section": "4000",
      "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=VEH&sectionNum=4000",
      "text": "(a) (1) A person shall not drive, move, or leave standing upon a highway, or in an offstreet public parking facility, any motor vehicle, trailer, semitrailer, pole or pipe dolly, or logging dolly, unless it is registered and the appropriate fees have been paid under this code or registered under the permanent trailer identification program, except that an off-highway motor vehicle which displays an identification plate or device issued by the department pursuant to Section 38010 may be driven, moved, or left standing in an offstreet public parking facility without being registered or paying registration fees.\n\n(2) For purposes of this subdivision, “offstreet public parking facility” means either of the following:\n\n(A) Any publicly owned parking facility.\n\n(B) Any privately owned parking facility for which no fee for the privilege to park is charged and which is held open for the common public use of retail customers.\n\n(3) This subdivision does not apply to any motor vehicle stored in a privately owned offstreet parking facility by, or with the express permission of, the owner of the privately owned offstreet parking facility.\n\n(4) (A) (i) A violation of this subdivision shall not be the sole basis for any enforcement action before the second month after the month of expiration of the vehicle’s registration.\n\n(ii) Notwithstanding clause (i), if a vehicle is stopped for any other violation of this code, enforcement action for a violation of this subdivision may be taken before the second month following the month of expiration.\n\n(B) This paragraph shall be operative from July 1, 2024, to January 1, 2030, inclusive.\n\n(b) A person shall not drive, move, or leave standing upon a highway any motor vehicle, as defined in Chapter 2 (commencing with Section 39010) of Part 1 of Division 26 of the Health and Safety Code, that has been registered in violation of Part 5 (commencing with Section 43000) of Division 26 of the Health and Safety Code.\n\n(c) Subdivisions (a) and (b) do not apply to off-highway motor vehicles operated pursuant to Sections 38025 and 38026.5.\n\n(d) This section does not apply, following payment of fees due for registration, during the time that registration and transfer is being withheld by the department pending the investigation of any use tax due under the Revenue and Taxation Code.\n\n(e) Subdivision (a) does not apply to a vehicle that is towed by a tow truck on the order of a sheriff, marshal, or other official acting pursuant to a court order or on the order of a peace officer acting pursuant to this code.\n\n(f) Subdivision (a) applies to a vehicle that is towed from a highway or offstreet parking facility under the direction of a highway service organization when that organization is providing emergency roadside assistance to that vehicle. However, the operator of a tow truck providing that assistance to that vehicle is not responsible for the violation of subdivision (a) with respect to that vehicle. The owner of an unregistered vehicle that is disabled and located on private property, shall obtain a permit from the department pursuant to Section 4003 prior to having the vehicle towed on the highway.\n\n(g) (1) Pursuant to Section 4022 and to subparagraph (B) of paragraph (3) of subdivision (o) of Section 22651, a vehicle obtained by a licensed repossessor as a release of collateral is exempt from registration pursuant to this section for purposes of the repossessor removing the vehicle to their storage facility or the facility of the legal owner. A law enforcement agency, impounding authority, tow yard, storage facility, or any other person in possession of the collateral shall release the vehicle without requiring current registration and pursuant to subdivision (f) of Section 14602.6.\n\n(2) The legal owner of collateral shall, by operation of law and without requiring further action, indemnify and hold harmless a law enforcement agency, city, county, city and county, the state, a tow yard, storage facility, or an impounding yard from a claim arising out of the release of the collateral to a licensee, and from any damage to the collateral after its release, including reasonable attorney’s fees and costs associated with defending a claim, if the collateral was released in compliance with this subdivision.\n\n(h) For purposes of this section, possession of a California driver’s license by the registered owner of a vehicle shall give rise to a rebuttable presumption that the owner is a resident of California.",
      "scraped": "2026-01-26T02:29:13.398Z",
      "title": "Vehicle registration required",
      "keywords": ["registration", "register", "dmv"]
    },
    {
      "code": "VEH",
      "section": "12500",
      "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=VEH&sectionNum=12500",
      "text": "(a) A person may not drive a motor vehicle upon a highway, unless the person then holds a valid driver’s license issued under this code, except those persons who are expressly exempted under this code.\n\n(b) A person may not drive a motorcycle, motor-driven cycle, or motorized bicycle upon a highway, unless the person then holds a valid driver’s license or endorsement issued under this code for that class, except those persons who are expressly exempted under this code, or those persons specifically authorized to operate motorized bicycles or motorized scooters with a valid driver’s license of any class, as specified in subdivision (h) of Section 12804.9.\n\n(c) A person may not drive a motor vehicle in or upon any offstreet parking facility, unless the person then holds a valid driver’s license of the appropriate class or certification to operate the vehicle. As used in this subdivision, “offstreet parking facility” means any offstreet facility held open for use by the public for parking vehicles and includes any publicly owned facilities for offstreet parking, and privately owned facilities for offstreet parking where no fee is charged for the privilege to park and which are held open for the common public use of retail customers.\n\n(d) A person may not drive a motor vehicle or combination of vehicles that is not of a type for which the person is licensed.\n\n(e) A motorized scooter operated on public streets shall at all times be equipped with an engine that complies with the applicable State Air Resources Board emission requirements.",
      "scraped": "2026-01-26T02:29:13.992Z",
      "title": "Driver license required",
      "keywords": ["license", "driving", "unlicensed"]
    },
    {
      "code": "VEH",
      "section": "14601",
      "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=VEH&sectionNum=14601",
      "text": "(a) No person shall drive a motor vehicle at any time when that person’s driving privilege is suspended or revoked for reckless driving in violation of Section 23103, 23104, or 23105, any reason listed in subdivision (a) or (c) of Section 12806 authorizing the department to refuse to issue a license, negligent or incompetent operation of a motor vehicle as prescribed in subdivision (e) of Section 12809, or negligent operation as prescribed in Section 12810.5, if the person so driving has knowledge of the suspension or revocation. Knowledge shall be conclusively presumed if mailed notice has been given by the department to the person pursuant to Section 13106. The presumption established by this subdivision is a presumption affecting the burden of proof.\n\n(b) A person convicted under this section shall be punished as follows:\n\n(1) Upon a first conviction, by imprisonment in a county jail for not less than five days or more than six months and by a fine of not less than three hundred dollars ($300) or more than one thousand dollars ($1,000).\n\n(2) If the offense occurred within five years of a prior offense that resulted in a conviction of a violation of this section or Section 14601.1, 14601.2, or 14601.5, by imprisonment in a county jail for not less than 10 days or more than one year and by a fine of not less than five hundred dollars ($500) or more than two thousand dollars ($2,000).\n\n(c) If the offense occurred within five years of a prior offense that resulted in a conviction of a violation of this section or Section 14601.1, 14601.2, or 14601.5, and is granted probation, the court shall impose as a condition of probation that the person be confined in a county jail for at least 10 days.\n\n(d) Nothing in this section prohibits a person from driving a motor vehicle, that is owned or utilized by the person’s employer, during the course of employment on private property that is owned or utilized by the employer, except an offstreet parking facility as defined in subdivision (c) of Section 12500.\n\n(e) When the prosecution agrees to a plea of guilty or nolo contendere to a charge of a violation of this section in satisfaction of, or as a substitute for, an original charge of a violation of Section 14601.2, and the court accepts that plea, except, in the interest of justice, when the court finds it would be inappropriate, the court shall, pursuant to Section 23575, require the person convicted, in addition to any other requirements, to install a certified ignition interlock device on any vehicle that the person owns or operates for a period not to exceed three years.\n\n(f) This section also applies to the operation of an off-highway motor vehicle on those lands to which the Chappie-Z’berg Off-Highway Motor Vehicle Law of 1971 (Division 16.5 (commencing with Section 38000)) applies as to off-highway motor vehicles, as described in Section 38001.",
      "scraped": "2026-01-26T02:29:14.595Z",
      "title": "Driving on suspended license",
      "keywords": ["suspended", "license", "driving"]
    },
    {
      "code": "VEH",
      "section": "22350",
      "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=VEH&sectionNum=22350",
      "text": "No person shall drive a vehicle upon a highway at a speed greater than is reasonable or prudent having due regard for weather, visibility, the traffic on, and the surface and width of, the highway, and in no event at a speed which endangers the safety of persons or property.",
      "scraped": "2026-01-26T02:29:15.183Z",
      "title": "Basic speed law",
      "keywords": ["speed", "speeding", "safe"]
    },
    {
      "code": "VEH",
      "section": "23152",
      "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=VEH&sectionNum=23152",
      "text": "(a) It is unlawful for a person who is under the influence of any alcoholic beverage to drive a vehicle.\n\n(b) It is unlawful for a person who has 0.08 percent or more, by weight, of alcohol in his or her blood to drive a vehicle.\n\nFor purposes of this article and Section 34501.16, percent, by weight, of alcohol in a person’s blood is based upon grams of alcohol per 100 milliliters of blood or grams of alcohol per 210 liters of breath.\n\nIn any prosecution under this subdivision, it is a rebuttable presumption that the person had 0.08 percent or more, by weight, of alcohol in his or her blood at the time of driving the vehicle if the person had 0.08 percent or more, by weight, of alcohol in his or her blood at the time of the performance of a chemical test within three hours after the driving.\n\n(c) It is unlawful for a person who is addicted to the use of any drug to drive a vehicle. This subdivision shall not apply to a person who is participating in a narcotic treatment program approved pursuant to Article 3 (commencing with Section 11875) of Chapter 1 of Part 3 of Division 10.5 of the Health and Safety Code.\n\n(d) It is unlawful for a person who has 0.04 percent or more, by weight, of alcohol in his or her blood to drive a commercial motor vehicle, as defined in Section 15210. In a prosecution under this subdivision, it is a rebuttable presumption that the person had 0.04 percent or more, by weight, of alcohol in his or her blood at the time of driving the vehicle if the person had 0.04 percent or more, by weight, of alcohol in his or her blood at the time of the performance of a chemical test within three hours after the driving.\n\n(e) Commencing July 1, 2018, it shall be unlawful for a person who has 0.04 percent or more, by weight, of alcohol in his or her blood to drive a motor vehicle when a passenger for hire is a passenger in the vehicle at the time of the offense. For purposes of this subdivision, “passenger for hire” means a passenger for whom consideration is contributed or expected as a condition of carriage in the vehicle, whether directly or indirectly flowing to the owner, operator, agent, or any other person having an interest in the vehicle. In a prosecution under this subdivision, it is a rebuttable presumption that the person had 0.04 percent or more, by weight, of alcohol in his or her blood at the time of driving the vehicle if the person had 0.04 percent or more, by weight, of alcohol in his or her blood at the time of the performance of a chemical test within three hours after the driving.\n\n(f) It is unlawful for a person who is under the influence of any drug to drive a vehicle.\n\n(g) It is unlawful for a person who is under the combined influence of any alcoholic beverage and drug to drive a vehicle.",
      "scraped": "2026-01-26T02:29:15.782Z",
      "title": "DUI definition",
      "keywords": ["dui", "drunk driving", "alcohol"]
    },
    {
      "code": "UIC",
      "section": "1253",
      "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=UIC&sectionNum=1253",
      "text": "An unemployed individual is eligible to receive unemployment compensation benefits with respect to any week only if the director finds that:\n\n(a) A claim for benefits with respect to that week has been made in accordance with authorized regulations.\n\n(b) He or she has registered for work, and thereafter continued to report, at a public employment office or any other place as the director may approve. Either or both of the requirements of this subdivision may be waived or altered by authorized regulation as to partially employed individuals attached to regular jobs.\n\n(c) He or she was able to work and available for work for that week.\n\n(d) He has been unemployed for a waiting period of one week as defined in Section 1254, unless this waiting period has been waived pursuant to Section 8571 of the Government Code.\n\n(e) He or she conducted a search for suitable work in accordance with specific and reasonable instructions of a public employment office.\n\n(f) He or she participated as required by the director in reemployment activities, such as orientation and assessment if the individual has been identified pursuant to an automated profiling system as likely to exhaust regular unemployment benefits unless the individual has shown good cause for failure to participate.",
      "scraped": "2026-01-26T02:29:16.383Z",
      "title": "Eligibility for benefits",
      "keywords": ["unemployment", "eligible", "qualify"]
    },
    {
      "code": "UIC",
      "section": "1256",
      "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=UIC&sectionNum=1256",
      "text": "An individual is disqualified for unemployment compensation benefits if the director finds that he or she left his or her most recent work voluntarily without good cause or that he or she has been discharged for misconduct connected with his or her most recent work.\n\nAn individual is presumed to have been discharged for reasons other than misconduct in connection with his or her work and not to have voluntarily left his or her work without good cause unless his or her employer has given written notice to the contrary to the department as provided in Section 1327, setting forth facts sufficient to overcome the presumption. The presumption provided by this section is rebuttable.\n\nAn individual whose employment is terminated under the compulsory retirement provisions of a collective bargaining agreement to which the employer is a party, shall not be deemed to have left his or her work without good cause.\n\nAn individual may be deemed to have left his or her most recent work with good cause if he or she leaves employment to accompany his or her spouse or domestic partner to a place or to join him or her at a place from which it is impractical to commute to the employment. For purposes of this section “spouse” includes a person to whom marriage is imminent, and “domestic partner” includes a person to whom a domestic partnership, as described in Section 297 of the Family Code, is imminent.\n\nAn individual may be deemed to have left his or her most recent work with good cause if he or she leaves employment to protect his or her family, or himself or herself, from domestic violence abuse.\n\nAn individual shall be deemed to have left his or her most recent work with good cause if he or she elects to be laid off in place of an employee with less seniority pursuant to a provision in a collective bargaining agreement that provides that an employee with more seniority may elect to be laid off in place of an employee with less seniority when the employer has decided to lay off employees.",
      "scraped": "2026-01-26T02:29:16.982Z",
      "title": "Disqualification - quit",
      "keywords": ["quit", "voluntary", "disqualified"]
    },
    {
      "code": "UIC",
      "section": "1257",
      "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=UIC&sectionNum=1257",
      "text": "An individual is also disqualified for unemployment compensation benefits if:\n\n(a) He or she willfully, for the purpose of obtaining unemployment compensation benefits, either made a false statement or representation, including, but not limited to, using a false name, false social security number, or other false identification, with actual knowledge of the falsity thereof, or withheld a material fact in order to obtain any unemployment compensation benefits under this division.\n\n(b) He or she, without good cause, refused to accept suitable employment when offered to him or her, or failed to apply for suitable employment when notified by a public employment office.",
      "scraped": "2026-01-26T02:29:17.580Z",
      "title": "Disqualification - misconduct",
      "keywords": ["fired", "misconduct", "disqualified"]
    },
    {
      "code": "UIC",
      "section": "2601",
      "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=UIC&sectionNum=2601",
      "text": "The purpose of this part is to compensate in part for the wage loss sustained by any individual who is unable to work due to the employee’s own sickness or injury, the sickness or injury of a family member, or the birth, adoption, or foster care placement of a new child, and to reduce to a minimum the suffering caused by unemployment resulting therefrom. This part shall be construed liberally in aid of its declared purpose to mitigate the evils and burdens that fall on the unemployed worker and his or her family.",
      "scraped": "2026-01-26T02:29:18.177Z",
      "title": "Disability insurance",
      "keywords": ["disability", "sdi", "benefits"]
    },
    {
      "code": "WIC",
      "section": "11250",
      "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=WIC&sectionNum=11250",
      "text": "Aid, services, or both shall be granted under the provisions of this chapter, and subject to the regulations of the department, to families with related children under the age of 18 years, except as provided in Section 11253, in need thereof because they have been deprived of parental support or care due to:\n\n(a) The death, physical or mental incapacity, or incarceration of a parent.\n\n(b) The unemployment of a parent or parents.\n\n(c) Continued absence of a parent from the home due to divorce, separation, desertion, or any other reason, except absence occasioned solely by reason of the performance of active duty in the uniformed services of the United States. “Continued absence” exists when the nature of the absence is such as either to interrupt or to terminate the parent’s functioning as a provider of maintenance, physical care, or guidance for the child, and the known or indefinite duration of the absence precludes counting on the parent’s performance of the function of planning for the present support or care of the child. If these conditions exist, the parent may be absent for any reason, and may have left only recently or some time previously.",
      "scraped": "2026-01-26T02:29:19.460Z",
      "title": "CalWORKs eligibility",
      "keywords": ["calworks", "tanf", "cash aid"]
    },
    {
      "code": "WIC",
      "section": "18901",
      "url": "https://leginfo.legislature.ca.gov/faces/codes_displaySection.xhtml?lawCode=WIC&sectionNum=18901",
      "text": "(a) The eligibility of households shall be determined to the extent permitted by federal law.\n\n(b) In determining eligibility for CalFresh, minimum age requirements other than those that exist under federal law shall not be imposed.\n\n(c) The department shall establish verification policies and procedures for CalFresh applicants and beneficiaries in the event that necessary verification is not provided by the applicant or beneficiary to accompany the application, semiannual report, annual recertification, or any other form or submission that requests verification be provided at the time of submission. These policies and procedures, to the extent permitted by federal law, regulation, guidance, or a waiver thereof, shall require counties to first seek verification from available electronic sources or self-attestation before requesting documentary evidence from the applicant or beneficiary to complete required verification or pursuing secondary evidence to verify the necessary information. Notwithstanding the rulemaking provisions of the Administrative Procedure Act (Chapter 3.5 (commencing with Section 11340) of Part 1 of Division 3 of Title 2 of the Government Code), the department shall issue an all-county letter or similar instructions no later than January 1, 2021.",
      "scraped": "2026-01-26T02:29:20.775Z",
      "title": "CalFresh (food stamps)",
      "keywords": ["calfresh", "food stamps", "snap"]
    }
  ],
  "byKeyword": {
    "tenant": [
      {
        "code": "CIV",
        "section": "1940",
        "title": "Application of tenant law"
      }
    ],
    "rental": [
      {
        "code": "CIV",
        "section": "1940",
        "title": "Application of tenant law"
      }
    ],
    "lease": [
      {
        "code": "CIV",
        "section": "1940",
        "title": "Application of tenant law"
      }
    ],
    "landlord entry": [
      {
        "code": "CIV",
        "section": "1940.2",
        "title": "Landlord entry requirements"
      }
    ],
    "notice": [
      {
        "code": "CIV",
        "section": "1940.2",
        "title": "Landlord entry requirements"
      },
      {
        "code": "CIV",
        "section": "1946",
        "title": "Notice to terminate tenancy"
      }
    ],
    "privacy": [
      {
        "code": "CIV",
        "section": "1940.2",
        "title": "Landlord entry requirements"
      }
    ],
    "habitability": [
      {
        "code": "CIV",
        "section": "1941",
        "title": "Habitability requirements"
      },
      {
        "code": "CIV",
        "section": "1942.4",
        "title": "Rent withholding for violations"
      }
    ],
    "repairs": [
      {
        "code": "CIV",
        "section": "1941",
        "title": "Habitability requirements"
      },
      {
        "code": "CIV",
        "section": "1941.1",
        "title": "Untenantable dwelling conditions"
      }
    ],
    "livable": [
      {
        "code": "CIV",
        "section": "1941",
        "title": "Habitability requirements"
      }
    ],
    "uninhabitable": [
      {
        "code": "CIV",
        "section": "1941.1",
        "title": "Untenantable dwelling conditions"
      }
    ],
    "conditions": [
      {
        "code": "CIV",
        "section": "1941.1",
        "title": "Untenantable dwelling conditions"
      }
    ],
    "repair": [
      {
        "code": "CIV",
        "section": "1942",
        "title": "Tenant remedy for breach"
      }
    ],
    "deduct": [
      {
        "code": "CIV",
        "section": "1942",
        "title": "Tenant remedy for breach"
      }
    ],
    "remedy": [
      {
        "code": "CIV",
        "section": "1942",
        "title": "Tenant remedy for breach"
      }
    ],
    "rent withhold": [
      {
        "code": "CIV",
        "section": "1942.4",
        "title": "Rent withholding for violations"
      }
    ],
    "retaliation": [
      {
        "code": "CIV",
        "section": "1942.5",
        "title": "Retaliation prohibited"
      }
    ],
    "eviction": [
      {
        "code": "CIV",
        "section": "1942.5",
        "title": "Retaliation prohibited"
      },
      {
        "code": "CIV",
        "section": "1946.2",
        "title": "Just cause eviction"
      }
    ],
    "complaint": [
      {
        "code": "CIV",
        "section": "1942.5",
        "title": "Retaliation prohibited"
      }
    ],
    "terminate": [
      {
        "code": "CIV",
        "section": "1946",
        "title": "Notice to terminate tenancy"
      }
    ],
    "end lease": [
      {
        "code": "CIV",
        "section": "1946",
        "title": "Notice to terminate tenancy"
      }
    ],
    "just cause": [
      {
        "code": "CIV",
        "section": "1946.2",
        "title": "Just cause eviction"
      }
    ],
    "ab 1482": [
      {
        "code": "CIV",
        "section": "1946.2",
        "title": "Just cause eviction"
      },
      {
        "code": "CIV",
        "section": "1947.12",
        "title": "Rent cap (AB 1482)"
      }
    ],
    "rent cap": [
      {
        "code": "CIV",
        "section": "1947.12",
        "title": "Rent cap (AB 1482)"
      }
    ],
    "rent increase": [
      {
        "code": "CIV",
        "section": "1947.12",
        "title": "Rent cap (AB 1482)"
      }
    ],
    "security deposit": [
      {
        "code": "CIV",
        "section": "1950.5",
        "title": "Security deposit rules"
      }
    ],
    "refund": [
      {
        "code": "CIV",
        "section": "1950.5",
        "title": "Security deposit rules"
      }
    ],
    "deductions": [
      {
        "code": "CIV",
        "section": "1950.5",
        "title": "Security deposit rules"
      }
    ],
    "last month": [
      {
        "code": "CIV",
        "section": "1950.7",
        "title": "Last month rent as deposit"
      }
    ],
    "deposit": [
      {
        "code": "CIV",
        "section": "1950.7",
        "title": "Last month rent as deposit"
      }
    ],
    "landlord access": [
      {
        "code": "CIV",
        "section": "1954",
        "title": "Landlord right of access"
      }
    ],
    "entry": [
      {
        "code": "CIV",
        "section": "1954",
        "title": "Landlord right of access"
      }
    ],
    "24 hours": [
      {
        "code": "CIV",
        "section": "1954",
        "title": "Landlord right of access"
      }
    ],
    "final paycheck": [
      {
        "code": "LAB",
        "section": "201",
        "title": "Final wages - discharge"
      },
      {
        "code": "LAB",
        "section": "202",
        "title": "Final wages - quit"
      }
    ],
    "fired": [
      {
        "code": "LAB",
        "section": "201",
        "title": "Final wages - discharge"
      },
      {
        "code": "UIC",
        "section": "1257",
        "title": "Disqualification - misconduct"
      }
    ],
    "terminated": [
      {
        "code": "LAB",
        "section": "201",
        "title": "Final wages - discharge"
      }
    ],
    "quit": [
      {
        "code": "LAB",
        "section": "202",
        "title": "Final wages - quit"
      },
      {
        "code": "UIC",
        "section": "1256",
        "title": "Disqualification - quit"
      }
    ],
    "resignation": [
      {
        "code": "LAB",
        "section": "202",
        "title": "Final wages - quit"
      }
    ],
    "waiting time penalty": [
      {
        "code": "LAB",
        "section": "203",
        "title": "Penalty for late wages"
      }
    ],
    "late pay": [
      {
        "code": "LAB",
        "section": "203",
        "title": "Penalty for late wages"
      }
    ],
    "pay stub": [
      {
        "code": "LAB",
        "section": "226",
        "title": "Pay stub requirements"
      }
    ],
    "itemized statement": [
      {
        "code": "LAB",
        "section": "226",
        "title": "Pay stub requirements"
      }
    ],
    "sick leave": [
      {
        "code": "LAB",
        "section": "246",
        "title": "Paid sick leave"
      }
    ],
    "paid sick": [
      {
        "code": "LAB",
        "section": "246",
        "title": "Paid sick leave"
      }
    ],
    "illness": [
      {
        "code": "LAB",
        "section": "246",
        "title": "Paid sick leave"
      }
    ],
    "overtime": [
      {
        "code": "LAB",
        "section": "510",
        "title": "Overtime requirements"
      }
    ],
    "hours": [
      {
        "code": "LAB",
        "section": "510",
        "title": "Overtime requirements"
      }
    ],
    "time and half": [
      {
        "code": "LAB",
        "section": "510",
        "title": "Overtime requirements"
      }
    ],
    "meal break": [
      {
        "code": "LAB",
        "section": "512",
        "title": "Meal periods"
      }
    ],
    "lunch": [
      {
        "code": "LAB",
        "section": "512",
        "title": "Meal periods"
      }
    ],
    "30 minutes": [
      {
        "code": "LAB",
        "section": "512",
        "title": "Meal periods"
      }
    ],
    "minimum wage": [
      {
        "code": "LAB",
        "section": "1194",
        "title": "Minimum wage recovery"
      },
      {
        "code": "LAB",
        "section": "1197",
        "title": "Minimum wage requirement"
      }
    ],
    "underpaid": [
      {
        "code": "LAB",
        "section": "1194",
        "title": "Minimum wage recovery"
      }
    ],
    "hourly rate": [
      {
        "code": "LAB",
        "section": "1197",
        "title": "Minimum wage requirement"
      }
    ],
    "expense": [
      {
        "code": "LAB",
        "section": "2802",
        "title": "Expense reimbursement"
      }
    ],
    "reimbursement": [
      {
        "code": "LAB",
        "section": "2802",
        "title": "Expense reimbursement"
      }
    ],
    "mileage": [
      {
        "code": "LAB",
        "section": "2802",
        "title": "Expense reimbursement"
      }
    ],
    "divorce": [
      {
        "code": "FAM",
        "section": "2100",
        "title": "Disclosure requirements"
      }
    ],
    "disclosure": [
      {
        "code": "FAM",
        "section": "2100",
        "title": "Disclosure requirements"
      }
    ],
    "assets": [
      {
        "code": "FAM",
        "section": "2100",
        "title": "Disclosure requirements"
      }
    ],
    "child custody": [
      {
        "code": "FAM",
        "section": "3020",
        "title": "Best interest of child"
      }
    ],
    "best interest": [
      {
        "code": "FAM",
        "section": "3020",
        "title": "Best interest of child"
      }
    ],
    "custody": [
      {
        "code": "FAM",
        "section": "3040",
        "title": "Custody order priorities"
      }
    ],
    "parent": [
      {
        "code": "FAM",
        "section": "3040",
        "title": "Custody order priorities"
      }
    ],
    "order": [
      {
        "code": "FAM",
        "section": "3040",
        "title": "Custody order priorities"
      }
    ],
    "visitation": [
      {
        "code": "FAM",
        "section": "3100",
        "title": "Visitation rights"
      }
    ],
    "parenting time": [
      {
        "code": "FAM",
        "section": "3100",
        "title": "Visitation rights"
      }
    ],
    "child support": [
      {
        "code": "FAM",
        "section": "4055",
        "title": "Child support calculation"
      }
    ],
    "calculation": [
      {
        "code": "FAM",
        "section": "4055",
        "title": "Child support calculation"
      }
    ],
    "guideline": [
      {
        "code": "FAM",
        "section": "4055",
        "title": "Child support calculation"
      }
    ],
    "registration": [
      {
        "code": "VEH",
        "section": "4000",
        "title": "Vehicle registration required"
      }
    ],
    "register": [
      {
        "code": "VEH",
        "section": "4000",
        "title": "Vehicle registration required"
      }
    ],
    "dmv": [
      {
        "code": "VEH",
        "section": "4000",
        "title": "Vehicle registration required"
      }
    ],
    "license": [
      {
        "code": "VEH",
        "section": "12500",
        "title": "Driver license required"
      },
      {
        "code": "VEH",
        "section": "14601",
        "title": "Driving on suspended license"
      }
    ],
    "driving": [
      {
        "code": "VEH",
        "section": "12500",
        "title": "Driver license required"
      },
      {
        "code": "VEH",
        "section": "14601",
        "title": "Driving on suspended license"
      }
    ],
    "unlicensed": [
      {
        "code": "VEH",
        "section": "12500",
        "title": "Driver license required"
      }
    ],
    "suspended": [
      {
        "code": "VEH",
        "section": "14601",
        "title": "Driving on suspended license"
      }
    ],
    "speed": [
      {
        "code": "VEH",
        "section": "22350",
        "title": "Basic speed law"
      }
    ],
    "speeding": [
      {
        "code": "VEH",
        "section": "22350",
        "title": "Basic speed law"
      }
    ],
    "safe": [
      {
        "code": "VEH",
        "section": "22350",
        "title": "Basic speed law"
      }
    ],
    "dui": [
      {
        "code": "VEH",
        "section": "23152",
        "title": "DUI definition"
      }
    ],
    "drunk driving": [
      {
        "code": "VEH",
        "section": "23152",
        "title": "DUI definition"
      }
    ],
    "alcohol": [
      {
        "code": "VEH",
        "section": "23152",
        "title": "DUI definition"
      }
    ],
    "unemployment": [
      {
        "code": "UIC",
        "section": "1253",
        "title": "Eligibility for benefits"
      }
    ],
    "eligible": [
      {
        "code": "UIC",
        "section": "1253",
        "title": "Eligibility for benefits"
      }
    ],
    "qualify": [
      {
        "code": "UIC",
        "section": "1253",
        "title": "Eligibility for benefits"
      }
    ],
    "voluntary": [
      {
        "code": "UIC",
        "section": "1256",
        "title": "Disqualification - quit"
      }
    ],
    "disqualified": [
      {
        "code": "UIC",
        "section": "1256",
        "title": "Disqualification - quit"
      },
      {
        "code": "UIC",
        "section": "1257",
        "title": "Disqualification - misconduct"
      }
    ],
    "misconduct": [
      {
        "code": "UIC",
        "section": "1257",
        "title": "Disqualification - misconduct"
      }
    ],
    "disability": [
      {
        "code": "UIC",
        "section": "2601",
        "title": "Disability insurance"
      }
    ],
    "sdi": [
      {
        "code": "UIC",
        "section": "2601",
        "title": "Disability insurance"
      }
    ],
    "benefits": [
      {
        "code": "UIC",
        "section": "2601",
        "title": "Disability insurance"
      }
    ],
    "calworks": [
      {
        "code": "WIC",
        "section": "11250",
        "title": "CalWORKs eligibility"
      }
    ],
    "tanf": [
      {
        "code": "WIC",
        "section": "11250",
        "title": "CalWORKs eligibility"
      }
    ],
    "cash aid": [
      {
        "code": "WIC",
        "section": "11250",
        "title": "CalWORKs eligibility"
      }
    ],
    "calfresh": [
      {
        "code": "WIC",
        "section": "18901",
        "title": "CalFresh (food stamps)"
      }
    ],
    "food stamps": [
      {
        "code": "WIC",
        "section": "18901",
        "title": "CalFresh (food stamps)"
      }
    ],
    "snap": [
      {
        "code": "WIC",
        "section": "18901",
        "title": "CalFresh (food stamps)"
      }
    ]
  },
  "totals": {
    "codes": 6,
    "sections": 39,
    "keywords": 97,
    "totalChars": 107431
  }
}
